[
    {
        "ID":1,
        "Soru":"Bir AR-GE projesinin yaşam döngüsü hangi aşamalardan oluşur ve proje örnekleri hangi kriterlere göre incelenmelidir?",
        "İdeal Cevap (GT)":"Bir AR-GE projesinin yaşam döngüsü fikir aşaması, tasarım, geliştirme ve test süreçlerini kapsayan yönetim aşamalarından oluşur. Proje örneklerinin incelenmesinde ise projenin yenilikçilik, teknik belirsizlik ve sistematik çalışma gibi AR-GE kriterlerine uygunluğu dikkate alınmalıdır.",
        "Bağlam (Context)":"Bir AR-GE projesinin yaşam döngüsü (yönetim aşamaları) proje örneklerini AR-GE projesi kriterlerini dikkate alarak inceleyip tabloyu uygun şekilde doldurunuz.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"AR-GE Projesinin Yaşam Döngüsü",
        "Chunk_ID":3039
    },
    {
        "ID":2,
        "Soru":"Akıllı ev sistemlerinde hangi değişiklikler yapılabilir ve bunların örnekleri nelerdir?",
        "İdeal Cevap (GT)":"Akıllı ev sistemlerinde ev sahibinin isteklerine göre yapılan çeşitli değişiklikler bulunmaktadır. Bu değişiklikler arasında su, gaz gibi sızıntı problemi durumlarında vananın kapatılarak ev sahibinin haberdar edilmesi, ev dışında farklı bir ortamdan evdeki kameralara bağlanarak evin güvenlik kontrolünün yapılabilmesi yer almaktadır. Bu örnekler, akıllı evlerin güvenlik ve kontrol işlevselliğini artıran önemli uygulamalardır.",
        "Bağlam (Context)":"Belirli bir akıllı ev formatı yoktur. Ev sahibinin isteklerine göre akıllı evler şekillenir. Akıllı ev sistemlerinde bir ev içinde yapılabilecek örnek değişiklikler şunlardır: • Su, gaz gibi sızıntı problemi olabilecek durumlarda vananın kapatılarak ev sahibinin haberdar edilmesi • Ev dışında farklı bir ortamdan evdeki kameralara bağlanılarak evin güvenlik kontrolünün yapılabilmesi Akıllı ev sistemi olarak bir ev içinde yapılabile­ cek başka değişiklikleri araştırıp bir tanesini sı­ nıfınıza anlatınız. Akıllı evlerde kullanım farklılıklarına göre baş­ ka hangi sensörlerin olduğunu ve bu sen­ sörlerin akıllı ev yapı­ sı içindeki görevlerini araştırarak bir yazım programına kaydediniz. 2.9.4. Akıllı Fabrikalar Akıllı bir fabrika oluşturmanın en önemli kısmı sensörler ve sensör bağlantısı uygulamaktır. Sensörler imalat sektöründe son birkaç yıldır kullanılmaktadır ve birçok çeşidi mevcuttur. Bunlar arasında basınç, yakınlık, temas, ölçüm, yer değiştirme ve hız sensörleri, döner kodlayıcılar, kod okuyucular vb. bulunmaktadır. Sensörlerin tamamı elektromanyetik, fotoelektrik, optik, radyo ve diğer sinyaller gibi çeşitli girişler kullanmaktadır. Modern akıllı fabrikalar sensörlere yeni roller vermektedir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Akıllı Ev Sistemleri Özellikleri",
        "Chunk_ID":3016
    },
    {
        "ID":3,
        "Soru":"Anakartın kasa içine montajı öncesinde alınması gereken güvenlik önlemi ile montaj sırasındaki işlemler nelerdir?",
        "İdeal Cevap (GT)":"Anakartın montajına başlamadan önce antistatik eldiven giyilmeli veya vücuttaki statik elektrik boşaltılmalıdır. Montaj sürecinde anakart, üzerindeki vida deliklerinden bilgisayar kasasında bulunan anakart tepsisine PCB yükseltici ile monte edilir ve donanım parçaları anakart üzerine yerleştirilir. Son olarak ATX konnektörleri ile güç bağlantıları yapılarak ön panel konnektörlerinin bağlantıları tamamlanır.",
        "Bağlam (Context)":"Jumper uçlarına bağlanacak olan ön panel konnektörlerinin nereye bağlanacağı, anakart üzerindeki bu alanda gösterilmektedir. Ancak anakartın kullanma kılavuzunun incelenmesi ve bu kılavuzdaki bilgilere göre bağlanması tavsiye edilmektedir. 3.7.3. Anakartın Kasa İçine Montajı Anakartın montajına başlamadan önce antistatik eldiven giyilmeli veya vücuttaki statik elektrik boşaltılmalıdır. Daha sonra yapılacaklar şunlardır: • Anakart, üzerindeki vida deliklerinden bilgisayar kasasında bulunan anakart tepsisine PCB yükseltici (distans) ile monte edilir. • Donanım parçaları anakart üzerinde yerleştirilir. • ATX konnektörleri ile güç bağlantıları yapılır. • Ön panel konnektörlerinin bağlantıları yapılarak tamamlanır.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Anakart Montajı ve Bağlantıları",
        "Chunk_ID":3143
    },
    {
        "ID":4,
        "Soru":"Anakart nedir ve temel görevleri nelerdir?",
        "İdeal Cevap (GT)":"Anakart, tüm bilgisayar bileşenlerini doğrudan veya dolaylı olarak üzerinde barındıran elektronik bir bileşendir. Bilgisayarın çalışması için gerekli olan donanım birimlerinin başında gelerek ana donanım parçaları arasında yer almaktadır. Anakartın esas görevi, bilgisayar işlemcisini üzerinde barındırmak ve diğer tüm donanım birimlerinin işlemci ile iletişim kurmasını sağlamaktır.",
        "Bağlam (Context)":"Anakart ve Görevi Anakart, tüm bilgisayar bileşenlerini doğrudan veya dolaylı olarak üzerinde barındıran elektronik bir bileşendir. Anakartlar, bilgisayarın çalışması için gerekli olan donanım birimlerinin başında gelmektedir. Bu nedenle ana donanım parçaları arasında yer almaktadır. Anakartın esas görevi, bilgisayar işlemcisini (CPU) üzerinde barındırmak ve diğer tüm donanım birimlerinin işlemci ile iletişim kurmasını sağlamaktır. ’de bir anakart gösterilmiştir. 3.1.5. Anakart Standartları Her anakart birbirine benzemeyebilir. Anakartın şekli ve yerleşim düzenine biçim (form) faktörü denir. Biçim faktörü, bilgisayar kasasının şeklini etkilemektedir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Anakartın Tanımı ve Görevi",
        "Chunk_ID":3066
    },
    {
        "ID":5,
        "Soru":"Açık kaynak işletim sistemleri için geliştirilen antivirüs programları nelerdir ve ClamTk'nin kurulumu nasıl gerçekleştirilir?",
        "İdeal Cevap (GT)":"Açık kaynak işletim sistemleri için geliştirilen antivirüs programları arasında ClamTk yer almaktadır. ClamTk'nin kurulumu için öncelikle panel düğmesine tıklanarak açılan menüde “Pardus Mağaza” bağlantısının üzerine gelinmelidir. Ardından “Pardus Mağaza” penceresinin arama kısmına “ClamTk” yazılarak sonuç kısmında “ClamTk” programı bulunmalı ve “KUR” düğmesine tıklanarak uygulamanın bilgisayara kurulumu tamamlanmalıdır. Kurulum sonrası virüs tarama penceresi açılarak sistemin virüs taramasından geçirilmesi gerekmektedir.",
        "Bağlam (Context)":"Ancak veri güvenliğinin önemi düşünüldüğünde siber saldırılara ve virüs tehditlerine karşı açık kaynak işletim sistemlerinde de antivirüs programları kullanılır. Dış Donanım Birimleri İşletim Sistemleri Temel Kullanım 196 Açık kaynak işletim sistemleri için geliştirilen antivirüs programlarını araştırınız. Araştırmanız sonucunda virüs programlarından birini güvenlik ve performans kriterlerine göre seçiniz. Edindiğiniz bilgileri sınıfınızla paylaşınız. Örnek bir antivirüs programının açık kaynak işletim sistemine kurulumu uygulaması için aşağıdaki işlem adımlarını izleyiniz. Adım 1: Panel düğmesine tıklayınız ve açılan menüde “Pardus Mağaza” (Pardus store) bağlantısının üzerine geliniz. Adım 2: ’de görüldüğü gibi “Pardus Mağaza” penceresinin arama kısmına “ClamTk” (virüs tarama programı) yazınız. Ekranın sağında (sonuç kısmında) “ClanTk” programını görünüz. Burada “KUR” (GET) düğmesine tıklayarak uygulamanın bilgisayara kurulumunu gerçekleştiriniz. Adım 3: ’de kurulum işlemi tamanlanan antivirüs programına ait virüs tarama penceresi görülmektedir. Bu pencereyi açınız ve sisteminizi virüs taramasından geçiriniz. 6.2. İŞLETİM SİSTEMLERİNDE WEB TARAYICILARI KULLANIMI İşletim sistemlerin web tarayıcı kurulumu hem açık kaynak işletim sisteminde hem de kapalı kaynak işletim sisteminde uygulama yapılarak gösterilmiştir. 6.2.1. Kapalı Kaynak İşletim Sisteminde Web Tarayıcı Kurulumu Web tarayıcıları internet üzerinde kişilerin gerekli bilgilere ulaşabilmesine ve bu bilgileri kullanabilmesine olanak sağlar. Bu kaynaklar metinsel, görsel (video, resim) ve sese dayalı veriler şeklinde olabilir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Açık Kaynak Antivirüs Programları",
        "Chunk_ID":3473
    },
    {
        "ID":6,
        "Soru":"Ağ arabirim kartı nedir ve günümüzdeki kullanımı nasıldır?",
        "İdeal Cevap (GT)":"Ağ arabirim kartı, bilgisayarların ve diğer cihazların bir ağa bağlanmasını sağlayan donanımlardır. Günümüzde neredeyse tüm yeni bilgisayar anakartlarında bu bağlantı tümleşik olarak yer alır. Cihazlar kablolu ve kablosuz modelleri olmak üzere iki farklı şekilde üretilir.",
        "Bağlam (Context)":"Tablo 7.5’te aracı ağ cihazlarının isimleri ile cihazların OSI referans modelinde yer aldıkları katmanlar verilmiştir. Tablo 7.5: Ağ Cihazları ve OSI Katmanları 7.3.1.1. Ağ Arabirim Kartı Bilgisayarların ve diğer cihazların bir ağa bağlanmasını sağlayan donanımlara ağ arabirim kartı [NIC (network interface card)] denir. Günümüzde neredeyse tüm yeni bilgisayar anakartlarında tümleşik olarak ağ arabirim bağlantısı yer alır. Kablolu ve kablosuz modelleri bulunur. ’de genişleme kartı ve USB aygıtı olarak üretilen ağ arabirim kartları görülmektedir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Ağ Cihazları ve OSI Katmanları",
        "Chunk_ID":3575
    },
    {
        "ID":7,
        "Soru":"Yönlendirme nedir ve ağ katmanında bu süreç nasıl gerçekleştirilir?",
        "İdeal Cevap (GT)":"Yönlendirme, ağ paketlerinin yerel ağın dışında diğer ağlara gönderilmesidir. Ağ katmanında yönlendirme algoritmaları kullanılarak iki istasyon arasında verinin iletimi en kısa yoldan sağlanır. Bir paket, yönlendirici tarafından alındığında hedef IP adresi kontrol edilir ve yönlendirilir.",
        "Bağlam (Context)":"Yönlendirme, ağ paketlerinin yerel ağın dışında diğer ağlara gönderilmesidir. Ağ katmanında yönlendirme algoritmaları kullanılarak iki istasyon arasında verinin iletimi en kısa yoldan sağlanır. Bir paket, yönlendirici tarafından alındığında hedef (IP) adresi kontrol edilir ve yönlendirilir. Ayrıca mantıksal adresler fiziksel adreslere çevrilir. Ağ katmanında veri ve yönlendirme adında iki tür paket kullanılır. Veri paketleri kullanıcının bilgisini taşımak için kullanılır. Bu paketler IP ve IPX gibi yönlendirilebilir protokollerle taşınır.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Ağ Paketlerinin Yönlendirilmesi",
        "Chunk_ID":3530
    },
    {
        "ID":8,
        "Soru":"Yönlendirme nedir ve ağ katmanında hangi paket türleri kullanılır?",
        "İdeal Cevap (GT)":"Yönlendirme, ağ paketlerinin yerel ağın dışında diğer ağlara gönderilmesidir. Ağ katmanında yönlendirme algoritmaları kullanılarak iki istasyon arasında verinin iletimi en kısa yoldan sağlanır. Ağ katmanında veri ve yönlendirme adında iki tür paket kullanılır; veri paketleri, kullanıcı bilgisini taşımak için kullanılır ve IP ile IPX gibi yönlendirilebilir protokollerle taşınır.",
        "Bağlam (Context)":"Yönlendirme, ağ paketlerinin yerel ağın dışında diğer ağlara gönderilmesidir. Ağ katmanında yönlendirme algoritmaları kullanılarak iki istasyon arasında verinin iletimi en kısa yoldan sağlanır. Bir paket, yönlendirici tarafından alındığında hedef (IP) adresi kontrol edilir ve yönlendirilir. Ayrıca mantıksal adresler fiziksel adreslere çevrilir. Ağ katmanında veri ve yönlendirme adında iki tür paket kullanılır. Veri paketleri kullanıcının bilgisini taşımak için kullanılır. Bu paketler IP ve IPX gibi yönlendirilebilir protokollerle taşınır.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Ağ Yönlendirme ve Paket İletimi",
        "Chunk_ID":3530
    },
    {
        "ID":9,
        "Soru":"Bilgisayarların birimleri arasında veri iletimini sağlayan ve diğer donanım bileşenlerini üzerinde barındıran elektronik kartlara ne ad verilir?",
        "İdeal Cevap (GT)":"Anakartlar, bilgisayarların birimleri arasında veri iletimini sağlayan elektronik kartlardır. Bilgisayarın çalışması için gerekli olan anakart, diğer donanım bileşenlerini üzerinde barındırır.",
        "Bağlam (Context)":"Araştırınız. 3. İşlemciler aynı anda ne kadar işlem yapabilme kapasitesine sahiptir? Araştırınız. 4. Ekran kartı olmadan bilgisayar çalışabilir mi? Açıklayınız. 5. Sabit sürücüleri, kullandığımız bir ev eşyasına benzetmek istersek hangisi olabilir? Neden? 3.1. ANAKARTLAR Bilgisayarların birimleri arasında veri iletimini sağlayan elektronik kartlardır. Bilgisayarın çalışması için gerekli olan anakart diğer donanım bileşenlerini üzerinde barındırır.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Bilgisayar Donanımı ve Anakart",
        "Chunk_ID":3059
    },
    {
        "ID":10,
        "Soru":"Buluş olarak değerlendirilmeyecek ürünler nelerdir?",
        "İdeal Cevap (GT)":"Buluş olarak değerlendirilmeyecek ürünler; matematiksel metotlar, bilimsel kuramlar, fikirsel olgular, iş çalışmaları, bilgisayar yazılımları, görsel açıdan albenisi olan ürünler, sanatsal, bilimsel ve edebî ürünler, var olan bilginin sunumunun yapılması, cerrahi, tedavi ve teşhis prosedürleri, konusu toplum düzenine veya genel ahlaki düzene aykırı olan buluşlar ile bitki ve hayvan yetiştiriciliği prosedürleridir.",
        "Bağlam (Context)":"Buluşun özellikleri; yeni bir düşünce, metot ya da araç olması ve yeni bir fikir ile bir soruna çözüm bulması veya önceki fikirlerin geliştirilmiş hâlini sunmasıdır. Patent belgesi; buluş sahibinin, icadının 20 yıl süre ile üretimini yapmasını, kullanmasını ve satışını gerçekleştirmesini sağlamaktadır. Buluş olarak değerlendirilmeyecek ürünler de vardır: • Matematiksel metotlar, bilimsel kuramlar • Fikirsel olgular, iş çalışmaları • Bilgisayar yazılımları • Görsel açıdan albenisi olan ürünler; sanatsal, bilimsel ve edebî ürünler • Var olan bilginin sunumunun yapılması • Cerrahi, tedavi ve teşhis prosedürleri • Konusu toplum düzenine veya genel ahlaki düzene aykırı olan buluşlar • Bitki ve hayvan yetiştiriciliği prosedürleri Bir Patent Hikâyesi CAM SİLECEKLERİ VE ROBERT KEARNS 1964 yılında Robert Kearns, icat etmiş olduğu “Fasılalı (Zaman Ayarlı) Cam Silecekleri” adlı ürünün patentini aldı. Amerika’da ünlü bir araba markasına ürünü pazarlamak için götürdü ve bu icat, araba markası tarafından çok beğenildi. Araba markası, ürünü almak yerine izinsiz üretmeye başladı ve sonra bir başka araba markası da yine silecekleri izinsiz üreterek satmaya başladı. Robert Kearns bunun üzerine dava açtı ve 1978 yılında her iki şirket 10 milyon dolar tazminat ödemek zorunda kaldı.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Buluş ve Patent Özellikleri",
        "Chunk_ID":2954
    },
    {
        "ID":11,
        "Soru":"BIOS pili biterse ya da yeterli enerjiyi sağlayamazsa bilgisayarda ne tür bir durum oluşur?",
        "İdeal Cevap (GT)":"BIOS pili yeterli enerjiyi sağlayamaz ya da biterse bilgisayar açılış anında \"CMOS checksum error - defaults loaded\" yazılı hata mesajı verir ve BIOS üzerindeki bilgileri fabrika ayarına geri döndürür.",
        "Bağlam (Context)":"Aksi takdirde içerisinde kayıtlı bilgiler silinecektir. CMOS’un ihtiyaç duyduğu enerji ise anakart üzerinde yer alan BIOS pili sayesinde sağlanır. Bu pil, yeterli enerjiyi sağlayamaz ya da biterse bilgisayar açılış anında yazılı bir hata mesajı (CMOS checksum error - defaults loaded) verecek ve BIOS üzerindeki bilgileri fabrika ayarına geri döndürecektir. Bilgisayarınızın anakartından BIOS pilini çıkartınız ve bilgisayarınızı başlatmayı deneyiniz. Karşılaştığınız hata mesajını not alınız. 1980’li yıllardan beri kullanılan BIOS teknolojisi günümüze kadar çok fazla değişikliğe uğramamıştır.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"CMOS Pilinin İşlevi ve Arızası",
        "Chunk_ID":3343
    },
    {
        "ID":12,
        "Soru":"DLP cihazlarında kullanılan dijital mikroayna yongası (DMD) nedir ve nasıl bir yapıya sahiptir?",
        "İdeal Cevap (GT)":"Dijital mikroayna yongası, görüntüdeki her bir piksele ait ışığı yansıtabilen, ayrı ayrı açık veya kapalı duruma getirilebilen binlerce küçük alüminyum ayna parçacığından oluşan bir yapıdır. Bu yonga üzerinde her bir resim noktası ayrı bir ayna parçasının üzerinde bulunur. Buradaki temel amaç, gelen ışığı lense veya lens dışına göndermektir.",
        "Bağlam (Context)":"Bu tekerlek, görüntüyü oluşturmak için yüksek hızlarda döndürülür. DLP cihazlarında, optik yarı iletken diye bilinen dijital mikroayna yongası [DMD (digital micromirror device)] kullanılır. Renk tekerleği üzerinde oluşturulan renk demeti, şekillendirme merceğinde odaklanarak dijital mikroayna yongası üzerine yansıtılır. Bu yonga; görüntüdeki her bir piksele ait, ışığı yansıtabilen, ayrı ayrı açık veya kapalı duruma getirilebilen binlerce küçük alüminyum ayna parçacığından oluşur. Burada amaç, gelen ışığı lense veya lens dışına göndermektir. Her bir resim noktası ayrı bir ayna parçasının üzerindedir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"DLP Teknolojisinin Çalışma Prensibi",
        "Chunk_ID":3226
    },
    {
        "ID":13,
        "Soru":"Kablosuz klavyelerde kullanılan bağlantı birimi hangi bileşenlerden oluşmaktadır ve radyo frekansı teknolojisinin kızılötesi teknolojiye göre avantajı nedir?",
        "İdeal Cevap (GT)":"Kablosuz klavyelerde bağlantı birimi klavye alıcı ve verici devresinden oluşmaktadır. Radyo frekansı teknolojisine dayalı klavyeler kızılötesine göre daha uzun mesafelerde kullanılabilir.",
        "Bağlam (Context)":"4.11 140 Dış Donanım Birimleri A. cümlelerin başındaki boşluğa cümle doğru ise “D” yanlış ise “Y” yazınız. 1. (…..) Kablosuz klavyelerde bağlantı birimi, klavye alıcı ve verici devresinden oluşmaktadır. (…..) Radyo frekansı teknolojisine dayalı klavyeler kızılötesine göre daha uzun mesafelerde kullanılabilir. 2. 3. (…..) F klavye kullanılan bir bilgisayara Q klavye takıldığında işletim sisteminden klavye tipiyle ilgili bir ayar yapmak gerekmez. 4. (…..) Lazer farelerin çözünürlüğü fazla olduğundan yüzeydeki mikroskobik parçaları algılamaz ve bu parçalar farenin çalışmasında herhangi bir problem oluşturmaz. 5.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Dış Donanım Birimleri Test Soruları",
        "Chunk_ID":3317
    },
    {
        "ID":14,
        "Soru":"Dış donanım birimleri nelerdir ve her birinin temel işlevleri nelerdir?",
        "İdeal Cevap (GT)":"Dış donanım birimleri, bilgisayar kasası içerisinde yer almayan ve bilgisayarla çeşitli arabirimler üzerinden bağlantı kuran donanım birimleridir. Dış donanım birimleri, giriş ve çıkış olmak üzere iki başlıkta incelenir; giriş birimleri (klavye, fare, mikrofon vb.) bilgisayarlara veri girişi yapmak için kullanılırken, çıkış birimleri (monitör, hoparlör, yazıcı vb.) bilgisayarda işlenen verilerin kullanıcıya anlaşılabilir bir formda ulaşmasını sağlar. Bu birimler, bilgisayar sisteminin işlevselliğini artırarak kullanıcı ile bilgisayar arasındaki etkileşimi sağlar.",
        "Bağlam (Context)":"Araştırınız. 5. Hafıza kartları çeşitleri ve özellikleri nelerdir? 4.1. GİRİŞ BİRİMLERİ Bilgisayar kasası içerisinde yer almayan, bilgisayarla çeşitli arabirimler üzerinden bağlantı kuran donanım birimlerine dış donanım birimleri denir. Dış donanım birimleri giriş ve çıkış olmak üzere iki başlıkta incelenebilir. Klavye, fare, mikrofon vb., bilgisayarlara veri girişi yapmak için kullanılan parçalara giriş birimi; monitör, hoparlör, yazıcı vb., bilgisayarda işlenen verilerin kullanıcıya anlaşılabilir bir formda ulaşmasını sağlayan cihazlara çıkış birimi denir. 4.1.1. Klavye Klavye; üzerinde alfabe, sayı, sembol, özel karakter ve varsa fonksiyonel işlemlerin yer aldığı sıralı tuşlar bulunan, bilgisayar sistemine veri giriş işlemleri için kullanılan donanım birimidir. Kablolu, kablosuz ve dizüstü bilgisayarlarda kullanılan sabit türleri vardır. 4.1.1.1. Klavye Yapısal Özellikleri Kullanım ortamları, biçimsel özellikleri ve sahip olduğu teknolojilere göre klavye türleri değişmektedir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Dış Donanım Birimleri Özellikleri",
        "Chunk_ID":3160
    },
    {
        "ID":15,
        "Soru":"Ticari sır nedir ve hangi durumu ifade eder?",
        "İdeal Cevap (GT)":"Ticari sır, ticari kurumların elde ettikleri başarı ve randımanın oluşturduğu bilgi ve dokümanların üçüncü kişilerin eline geçmemesi ve öğrenilmemesi gerektiği durumlardır. Ticari sır, gizlilik arz eden bir durumdur.",
        "Bağlam (Context)":"’da endüstriyel tasarım örnekleri bulunmaktadır. Sizin aklınıza da bir şeyler geldi mi? Nasıl bir tasarım düşünüyorsunuz ve neyin görüntüsünü değiştirmek istiyorsunuz? • Paint benzeri bir program açınız ve tasarı­ mını yapmak istediğiniz şeyi rastgele çizerek arkadaşlarınıza anlatınız. • Not defteri benzeri bir program açınız ve tasarımını yapmak istediğiniz nesneyi arka­ daşlarınıza yazarak anlatınız. 1.4.6. Ticari Sır Ticari sır, ticari kurumların elde ettikleri başarı ve randımanın oluşturduğu bilgi ve dokümanların üçüncü kişilerin eline geçmemesi ve öğrenilmemesi gerektiği durumlardır. Ticari sır gizlilik arz eden bir durumdur.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Endüstriyel Tasarım ve Ticari Sır",
        "Chunk_ID":2958
    },
    {
        "ID":16,
        "Soru":"Etik kavramının sözlük anlamı nedir ve en çok bilinen altı etik ilke nelerdir?",
        "İdeal Cevap (GT)":"Sözlük anlamı olarak etik, ahlak ile ilgili olan kavramları tanımlamaktadır. En çok bilinen altı etik ilke dürüstlük, adalet, ahlak, vicdan, onur ve sorumluluktur.",
        "Bağlam (Context)":"Açıklayınız 5. Hiç “Aklıma gelen bu düşünce bir icat (buluş) olabilir.” dediğiniz oldu mu? Bir şey icat ederseniz hangi yolları izlemeniz gerektiğini biliyor musunuz? 1.1. ETİK VE BİLİŞİM ETİĞİ KAVRAMLARI 1.1.1. Etik ve Bilişim Etiği Sözlük anlamı olarak etik, ahlak ile ilgili olan kavramları tanımlamaktadır. En çok bilinen altı etik ilke şunlardır: dürüstlük, adalet, ahlak, vicdan, onur ve sorumluluk (). Günümüzde etik, daha çok iş hayatı içinde davranış biçimlerini düzenleyen ve etkileyen bir disiplin olarak yerini almıştır.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Etik ve Bilişim Etiği Kavramları",
        "Chunk_ID":2928
    },
    {
        "ID":17,
        "Soru":"OCR (Optik Karakter Tanıma) özelliği nedir?",
        "İdeal Cevap (GT)":"OCR (Optik Karakter Tanıma), taranan bir doküman içerisindeki harf, sayı, simge gibi karakterleri bulup tanıyarak metne çeviren dijital bir görüntü işleme teknolojisidir. OCR teknolojisi, orijinal olarak basılı metni tanımak için tasarlanmış olmasına rağmen, el yazısı ile yazılan metinleri tanıyıp doğrulamak için de kullanılabilmektedir. Bu özellik, otomatik veri girişi ve belge yönetimi gibi birçok alanda önemli bir uygulama alanı bulmuştur.",
        "Bağlam (Context)":"CCD tarayıcılara göre daha düşük renk derinliğine sahiptir. Bu nedenle görüntü kalitesi, CCD tarayıcılar kadar iyi değildir. 4.4.1.2.4. OCR (Optik Karakter Tanıma) Özelliği OCR; taranan bir doküman içerisindeki harf, sayı, simge gibi karakterleri bulup tanıyarak metne çeviren dijital bir görüntü işleme teknolojisidir. OCR teknolojisi, orijinal olarak basılı metni tanımak için tasarlanmış olsa da el yazısı ile yazılan metinleri tanıyıp doğrulamak için de kullanılabilir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Görüntü Kalitesi ve OCR Teknolojisi",
        "Chunk_ID":3278
    },
    {
        "ID":18,
        "Soru":"Hafıza kartları nedir ve temel özellikleri nelerdir?",
        "İdeal Cevap (GT)":"Hafıza kartları, verileri kalıcı olarak depolayan, kullanımı kolay ve taşınabilir hafıza birimleridir. Hafıza kartları, cep telefonları, bilgisayarlar, dijital fotoğraf makineleri ve dijital video kameralar gibi birçok cihazda kullanılır. Temel özellikleri arasında kapasite, okuma-yazma hızı, güvenlik ve çeşitleri gibi kavramlar bulunmaktadır. Kapasite, hafıza kartının depolayacağı veri miktarını belirten bir özellikken, okuma-yazma hızı ise hafıza kart performansını belirten en önemli kriterdir.",
        "Bağlam (Context)":": Ağ kamerası (optik algılayıcı) 134 Dış Donanım Birimleri 4.4.4. Hafıza Kartları Hafıza kartları; verileri kalıcı olarak depolayan, kullanımı kolay ve taşınabilir hafıza birimleridir. Cep telefonu, bilgisayar, dijital fotoğraf makinesi, dijital video kamera gibi birçok cihazda kullanılır. 4.4.4.1. Hafıza Kartları Temel Kavramlar Hafıza kartları teknik özelliklerinde kapasite, okuma-yazma hızı, güvenlik ve çeşitleri gibi kavramlar kullanılır. 4.4.4.1.1. Kapasite Hafıza kartının depolayacağı veri miktarı açısından önemlidir. Birimi GB cinsindendir. Büyük olması, depolanacak verilerin büyüklüğünü gösterir. 4.4.4.1.2. Okuma-Yazma Hızı Okuma-yazma hızı hafıza kart performansını belirten en önemli kriterdir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Hafıza Kartları ve Özellikleri",
        "Chunk_ID":3301
    },
    {
        "ID":19,
        "Soru":"Halka topolojisi nedir ve bu yapıda hangi iletim ortamları ile protokoller kullanılır?",
        "İdeal Cevap (GT)":"Halka topolojisi, düğümlerin bir daire etrafında uçtan uca bağlı olduğu bir yapıdır. Bu topolojide mesajlar daire boyunca aynı yönde ilerler, kullanılan iletim ortamları fiber optik veya çift bükümlü kablo olabilir ancak en çok çift bükümlü kablo tercih edilir. Halka topolojisinde FDDI, SONET veya token ring protokolleri kullanılır ve bu yapıda genelde token ring protokolü tercih edilir.",
        "Bağlam (Context)":"Halka Topolojisi (Ring Topology) Bu topolojide düğümler bir daire etrafında uçtan uca bağlıdır. Herhangi bir kablo veya düğüm arızalanırsa bağlantı bozulur. Halka topolojisinde mesajlar daire boyunca aynı yönde ilerler (Saat yönünde veya saat yönünün tersine etkilidir.). FDDI, SONET veya token ring protokolleri kullanılır. Halka topolojisinde fiber optik veya çift bükümlü kablo kullanılabilir. Ancak en çok çift bükümlü kablo tercih edilir. ’te halka topolojisine ait bağlantı diyagramı görülmektedir. Bu topolojide genelde token ring protokolü kullanılır. Token (jeton, 3 baytlık), düğümler arasında dolaşan bilgidir. Bu jeton ağda dolanır.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Halka Topolojisi ve Özellikleri",
        "Chunk_ID":3511
    },
    {
        "ID":20,
        "Soru":"İlk açılış sorunları BIOS tarafından nasıl belirlenir ve bu sorunlar genel olarak nasıl incelenir?",
        "İdeal Cevap (GT)":"Bilgisayar sisteminin açılış sorunları, BIOS tarafından yürütülen ve bilgisayar açılış düğmesine basıldıktan sonra sesli veya yazılı olarak bildirilen uyarı mesajları ile belirlenir. Genel olarak açılış sorunları işletim sisteminin yüklü olduğu sürücünün bulunamaması veya işletim sisteminin açılış için gerekli sistem dosyalarını bulamaması şeklinde incelenebilir. Bilgisayar çalıştırıldığı anda aktif olan BIOS, donanım birimlerinin kontrolünü yaptıktan sonra işletim sisteminin yüklenmesini (boot) sağlar.",
        "Bağlam (Context)":"Kapalı Kaynak Kodlu İşletim Sisteminde Karşılaşılan Sorunlar ve Çözümleri Kapalı kaynak kodlu işletim sisteminde karşılaşılabilecek sorunlar yazılım tabanlı değilse donanım tabanlı olarak düşünülebilir. Karşılaşılacak sorun(lar) hangi türde olursa olsun çözüm üretilebilmesi için sorunun tespiti önemlidir. 5.8.1.1. İlk Açılış Sorunları Bilgisayar sisteminin açılış sorunları, BIOS tarafından yürütülen ve bilgisayar açılış düğmesine basıldıktan sonra (sistemin başlatılması) sesli veya yazılı olarak bildirilen uyarı mesajları ile belirlenebilir. Genel olarak açılış sorunları işletim sisteminin yüklü olduğu sürücünün bulunamaması veya işletim sisteminin açılış için gerekli sistem dosyalarını bulamaması şeklinde incelenebilir. 1. İşletim Sistemini Bulamama Sorunu: Bilgisayar çalıştırıldığı anda aktif olan BIOS, donanım birimlerinin kontrolünü yaptıktan sonra işletim sisteminin yüklenmesini (boot) sağlar.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Kapalı Kaynak Kodlu İşletim Sistemi Sorunları ve Çözümleri",
        "Chunk_ID":3414
    },
    {
        "ID":21,
        "Soru":"Klavye bağlantı türleri nelerdir?",
        "İdeal Cevap (GT)":"Klavye bağlantı türleri kablolu veya kablosuz olmak üzere ikiye ayrılır.",
        "Bağlam (Context)":"a) Klavye bağlantı türleri kablolu veya kablosuz olmak üzere ikiye ayrılır. Klavyenizde hangi tür bağlantı kullanılmaktadır? ............................................................................................................................................................ : Kablolu fare arabirimleri (1-PS\/2, 2-Seri, 3-USB) USB bağlantı arabirimlerinin az sayıda bulunması nedeniyle birden fazla aygıtın bağlanabileceği ortak alıcı sistemleri de geliştirilmiştir. 4.1 104 Dış Donanım Birimleri b) Klavye, bilgisayarınıza hangi arabirim üzerinden bağlanmıştır? Bilgisayarınızdan klavye bağlantısını sökünüz.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Klavye Bağlantı Türleri",
        "Chunk_ID":3178
    },
    {
        "ID":22,
        "Soru":"LCD projeksiyon yapısında kullanılan ışık kaynakları nelerdir ve ışın demetleri ilk aşamada nasıl bir sürece tabi tutulur?",
        "İdeal Cevap (GT)":"LCD projeksiyon yapısında ışık kaynağı olarak metal halojenür (ARC veya UHT) lamba, LED veya lazer kullanılır. Işık kaynağından çıkan ışın demetleri öncelikle dikroik kırmızı ve mavi renkli aynalardan geçer.",
        "Bağlam (Context)":"’te LCD projeksiyon yapısı görülmektedir. Bu projeksiyonlarda ışık kaynağı olarak metal halojenür (ARC veya UHT) lamba, LED veya lazer kullanılabilir. Işık kaynağından çıkan ışın demetleri öncelikle dikroik kırmızı ve mavi renkli aynalardan geçer.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"LCD Projeksiyon Teknolojisi",
        "Chunk_ID":3223
    },
    {
        "ID":23,
        "Soru":"Modern akıllı fabrikalarda yeni nesil sensörlerin rolleri nelerdir?",
        "İdeal Cevap (GT)":"Yeni nesil sensörlerin akıllı fabrikalardaki rolleri akıllı, iletişime hazır ve öncekilerden daha hızlı konuşlanabilir olmalarıdır. Konum izleme sensörleri ile donatılan bu yapılar, alanda yapılan çalışmaların, makinelerin ve üretimle ilgili diğer ögelerin kesin konumlarını belirleyerek hem üretim sürecinin mevcut durumunu takip eder hem de ne zaman değiştirilmesi gerektiğini saptar.",
        "Bağlam (Context)":"Modern akıllı fabrikalar sensörlere yeni roller vermektedir. Bu roller yeni nesil sensörlerin akıllı, iletişime hazır ve öncekilerden daha hızlı konuşlanabilir olmasıdır. Konum izleme sensörleri ile donatılmış akıllı fabrikalar; alanda yapılan çalışmaların, makinelerin ve üretimle ilgili diğer ögelerin kesin konumlarını belirleyebilir. Bu ögeleri takip ederek ve aralarındaki etkileşimleri izleyerek fabrika, hem üretim sürecinin mevcut durumunu takip edebilir hem de ne zaman değiştirilmesi gerektiğini belirleyebilir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Modern Akıllı Fabrikalarda Sensör Teknolojisi",
        "Chunk_ID":3017
    },
    {
        "ID":24,
        "Soru":"1.024 × 768 ifadesi neyi ifade eder ve görüntülenebilecek çözünürlüğün belirlenmesinde hangi kriterler etkili olur?",
        "İdeal Cevap (GT)":"1.024 × 768 ifadesi, genişliğin 1.024 piksel ve yüksekliğin 768 piksel olduğu anlamına gelir. Görüntülenebilecek çözünürlük değeri, ekran paneli ve bilgisayar ekran kartı teknik özellikleri dikkate alınarak belirlenir; örneğin monitörün 1.920 x 1.080 desteklemesine rağmen ekran kartının 1.280 x 720 desteği varsa görüntü 1.280 x 720 olarak oluşur.",
        "Bağlam (Context)":"Örneğin “1.024 × 768” ifadesi, genişliğin 1.024 piksel ve yüksekliğin 768 piksel olduğu anlamına gelir. Tablo 4.1’de monitör ve diğer görüntüleme (projeksiyon cihazı vb.) aygıtlarına ait standart çözünürlük değerleri ve ekran oranları görülmektedir. Tablo 4.1: Standart Çözünürlük ve Ekran Oranları VGA 640 480 4:3 0,307 WVGA 768 480 16:10 0,368 WVGA 720 480 3:2 0,345 WVGA 800 480 5:3 0,384 FWVGA ≈854 480 16:9 0,410 SVGA 800 600 4:3 0,480 WSVGA 1.024 576 16:9 0,590 WSVGA 1.024 600 128:75 0,614 DVGA 960 640 3:2 0,614 XGA 1.024 768 4:3 0,786 HD 1.280 720 16:9 0,922 WXGA 1.280 800 16:10 1,024 HD + 1.600 900 16:9 1,440 FHD 1.920 1.080 16:9 2,074 WUXGA 1.920 1.200 16:10 2,304 QHD 2.560 1.440 16:9 3,686 QHD + 3.200 1.800 16:9 5,760 4K UHD 3.840 2.160 16:9 8,294 5K 5.120 2.880 16:9 14,746 8K UHD 7.680 4.320 16:9 33,170 16K QUHD 15.360 8.640 16:9 132,710 Monitör çözünürlük değerleri, ekran paneli ve bilgisayar ekran kartı teknik özellikleri dikkate alınarak belirlenir. Örneğin 1.920 x 1.080 çözünürlük desteğine sahip bir monitörde bilgisayar ekran kartı en fazla 1.280 x 720 çözünürlüğü desteklemektedir. Bu durumda monitörde görüntülenebilecek görüntü 1.280 x 720 olur. törün ekran ölçüleri görülmektedir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Monitör Çözünürlük ve Ekran Oranları",
        "Chunk_ID":3187
    },
    {
        "ID":25,
        "Soru":"OCR teknolojisi hangi amaçlarla kullanılır ve bu işlem için geliştirilen yazılımların özellikleri nelerdir?",
        "İdeal Cevap (GT)":"OCR teknolojisi, orijinal olarak basılı metni tanımak için tasarlanmış olsa da el yazısı ile yazılan metinleri tanıyıp doğrulak için de kullanılır. OCR işlemi için geliştirilen profesyonel yazılımlar, gelişmiş algoritma ve veri tabanı kütüphaneleri sayesinde metin tanıma ve belge dönüştürme işlemlerini yüksek doğruluk ve verimlilikte sunar.",
        "Bağlam (Context)":"OCR teknolojisi, orijinal olarak basılı metni tanımak için tasarlanmış olsa da el yazısı ile yazılan metinleri tanıyıp doğrulamak için de kullanılabilir. : Çözünürlük-dpi ilişkisi : Renk derinliği (Soldaki görsel 8 bit, sağdaki görsel 24 bit) 130 Dış Donanım Birimleri Sadece OCR işlemi için geliştirilmiş profesyonel yazılımlar bulunur. Bu yazılımlar, gelişmiş algoritma ve veri tabanı kütüphaneleri sayesinde metin tanıma ve belge dönüştürme işlemlerini yüksek doğruluk ve verimlilikte sunar. 4.4.1.3.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"OCR Teknolojisi ve Kullanımı",
        "Chunk_ID":3279
    },
    {
        "ID":26,
        "Soru":"OCR teknolojisi nedir ve hangi tür metinleri tanımak için kullanılır?",
        "İdeal Cevap (GT)":"OCR, taranan bir doküman içerisindeki harf, sayı, simge gibi karakterleri bulup tanıyarak metne çeviren dijital bir görüntü işleme teknolojisidir. Bu teknoloji orijinal olarak basılı metni tanımak için tasarlanmış olsa da el yazısı ile yazılan metinleri tanıyıp doğrulak için de kullanılabilir.",
        "Bağlam (Context)":"CCD tarayıcılara göre daha düşük renk derinliğine sahiptir. Bu nedenle görüntü kalitesi, CCD tarayıcılar kadar iyi değildir. 4.4.1.2.4. OCR (Optik Karakter Tanıma) Özelliği OCR; taranan bir doküman içerisindeki harf, sayı, simge gibi karakterleri bulup tanıyarak metne çeviren dijital bir görüntü işleme teknolojisidir. OCR teknolojisi, orijinal olarak basılı metni tanımak için tasarlanmış olsa da el yazısı ile yazılan metinleri tanıyıp doğrulamak için de kullanılabilir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"OCR Teknolojisi ve Özellikleri",
        "Chunk_ID":3278
    },
    {
        "ID":27,
        "Soru":"Aktif matris organik ışık yayan diyot (AMOLED) ve plastik ışık yayan diyot (POLED) ekranlar hangi aygıtlarda yaygın olarak kullanılmaktadır?",
        "İdeal Cevap (GT)":"Aktif matris organik ışık yayan diyot (AMOLED) ve plastik ışık yayan diyot (POLED) ekranlar yaygın olarak akıllı telefon, televizyon, monitör gibi aygıtlarda kullanılmaktadır. Bu ekran türleri organik ışık yayan diyot ekranların birer çeşidi olarak günümüzde tercih edilmektedir.",
        "Bağlam (Context)":"Tipik olarak bu elektrotlardan en az biri şeffaftır. ’de OLED ekran yapısı görülmektedir. Günümüzde organik ışık yayan diyot ekranlar ile bu ekranların türü olan aktif matris organik ışık yayan diyot (AMOLED) ve plastik ışık yayan diyot (POLED) ekranlar yaygın olarak akıllı telefon, televizyon, monitör gibi aygıtlarda kullanılmaktadır. Organik ışık yayan diyot ekranlar yüksek kontrast ve parlaklık değerlerine sahiptir. Ayrıca çok hafif olmaları da bir avantajdır. En büyük dezavantajları ise üretim maliyetlerinin diğer ekranlara göre fazla olmasıdır. 4.2.1.3.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"OLED Ekran Teknolojisi",
        "Chunk_ID":3208
    },
    {
        "ID":28,
        "Soru":"Orta format makineler nedir ve hangi özelliklere sahiptir?",
        "İdeal Cevap (GT)":"Orta format makineler, DSLR türlerinden daha büyük olan fotoğraf makineleridir ve profesyonel kullanıcılar tarafından tercih edilmektedir. Bu makineler, çoğunlukla stüdyo kullanımına uygun olarak tasarlanmış olup, çok yüksek görüntü çözünürlüklerine ulaşma imkanı sunar.",
        "Bağlam (Context)":"4.4.2.2.4. Orta Format Makineler DSLR türlerinden daha büyük olan bu makineler, profesyonel kullanıcılar tarafından tercih edilmekte olup çoğunlukla stüdyo kullanımına uygun tasarlanmaktadır. Çok yüksek görüntü çözünürlüklerine ulaşmak mümkündür. 4.4.3. Ağ Kameraları (Webcam) Ağ kameraları (USB kameralar), fotoğraf ve görüntü aktarımı için kullanılan donanım aygıtlarıdır. İnternet altyapısı üzerinden ses ve görüntü aktarımı yapabilir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Orta Format ve Ağ Kameraları",
        "Chunk_ID":3297
    },
    {
        "ID":29,
        "Soru":"Patch panel nedir ve hangi özelliklere sahiptir?",
        "İdeal Cevap (GT)":"Patch panel, ağda kullanılan bir dağıtım cihazıdır ve genellikle sekiz porta sahiptir. Patch panelin ön kısmında RJ45 girişine patch cord veya patch kablo bağlanırken, patch kablonun diğer ucu ağ cihazına bağlanır. Patch paneller üzerlerindeki konnektör girişleri, boyutları ve bağlanan kablo kategorisine göre tanımlanır ve genellikle 19’’ genişliğindedir; yüksekliği ise “u” simgesi ile belirtilir ve bir u değeri 1,75 inçe (44,45 mm) karşılık gelir.",
        "Bağlam (Context)":"’de sekiz porta sahip bir patch panelin ön ve arka kısımları görülmektedir. : Sekiz port patch panel (ön ve arka kısım) Panelin ön kısmında yer alan RJ45 girişine patch cord veya patch kablo adı verilen fabrikasyon olarak üretilmiş ağ kablosu bağlanır. Patch cord kablonun diğer ucu ise ağ cihazına bağlanır. Patch panel kullanımı, ağda sonradan meydana gelebilecek kablo arızasına müdahaleyi de kolaylaştırmaktadır. Patch paneller üzerlerindeki konnektör girişleri, boyutları ve bağlanan kablo kategorisine göre tanımlanır. Patch panel yüksekliği “u” simgesi ile belirtilir. Bir u değeri 1,75 inçe (44,45 mm) karşılık gelir. Patch panellerin genişliği ise “inç” cinsinden belirtilir. Genellikle kabin ve kabinet boyutu dikkate alındığında patch paneller 19’’ genişliğindedir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Patch Panel Kullanımı ve Özellikleri",
        "Chunk_ID":3611
    },
    {
        "ID":30,
        "Soru":"Projektörün doğal çözünürlüğü nedir ve fiziksel bir sınırlaması var mıdır?",
        "İdeal Cevap (GT)":"Projektörün doğal çözünürlüğü, projektörün sahip olduğu sabit piksel dizisine karşılık gelen gerçek fiziksel çözünürlüktür. Her projektörün sabit bir piksel dizisi bulunur ve bu durum projektörün gerçek, fiziksel çözünürlüğünü oluşturur. Projektör, doğal çözünürlüğüne bağlı olarak gerçek piksel adedinden fazla piksel görüntüleyemez.",
        "Bağlam (Context)":"4.2.2.1.1. Çözünürlük Çözünürlük, görüntünün kaç noktadan (pikselden) oluştuğunu belirtir. Her projektör, sabit bir piksel dizisine sahiptir. Bu sabit piksel dizisi, projektörün doğal çözünürlüğü olarak bilinir. Doğal çözünürlük; projektörün gerçek, fiziksel çözünürlüğüdür. Projektör, gerçek piksel adedinden fazla piksel görüntüleyemez.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Projektör Doğal Çözünürlüğü",
        "Chunk_ID":3216
    },
    {
        "ID":31,
        "Soru":"Sabit disk sürücülerinde veri transferi için kullanılan kablo türleri nelerdir ve özellikleri nedir?",
        "İdeal Cevap (GT)":"Veri transferi açısından 2 tür kablo bulunmaktadır. Bunlar PATA (paralel ATA) ve SATA (serial ATA) veri iletim teknolojileridir. PATA kablolar IDE kablosu olarak da anılır, 40 veya 80 pinli bir kablo ile saniyede 133 MB (133 MBps) veri aktarımı sağlamaktadır. SATA veri aktarım teknolojisi daha yeni bir teknoloji olup daha az hacim kaplamaktadır, 7 pin ile saniyede yaklaşık 2 GB veri aktarımı sağlayabilir.",
        "Bağlam (Context)":"Sabit Disk Sürücü Kabloları Veri transferi açısından 2 tür kablo bulunmaktadır. Bunlar, PATA (paralel ATA) ve SATA (serial ATA) veri iletim teknolojileridir. PATA kablolar IDE kablosu olarak da anılır. 40 veya 80 pinli bir kablo ile saniyede 133 MB (133 MBps) veri aktarımı sağlamaktadır. ’de PATA ve SATA kablosu gösterilmiştir. SATA veri aktarım teknolojisi daha yeni bir teknoloji olup daha az hacim kaplamaktadır. 7 pin ile saniyede yaklaşık 2 GB veri aktarımı sağlayabilir. 3.5.3. Sabit Disk Seçimi Disk seçimi yaparken öncelikle ihtiyaçlar iyi belirlenmelidir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Sabit Disk Sürücü Kabloları",
        "Chunk_ID":3128
    },
    {
        "ID":32,
        "Soru":"Günümüzde sabit sürücülerin temel türleri nelerdir ve manyetik diske sahip sürücülerin çalışma prensibi nasıldır?",
        "İdeal Cevap (GT)":"Günümüzde sabit sürücüler genellikle manyetik diske sahip sürücüler veya katı hâl sürücüleri olarak iki türdedir. Manyetik diske sahip sürücüler, bir motora bağlıdır ve bu motor yardımı ile dönmektedir. Motorun dönüş hızı, dakikadaki dönüş sayısı (Rpm) ile ifade edilir.",
        "Bağlam (Context)":"Tanıyorum: Kullandığınız sabit sürücüyü inceleyerek aşağıdaki boşlukları uygun ifadelerle doldurunuz. Adım 1: Günümüzde sabit sürücüler genellikle manyetik diske sahip sürücüler veya katı hâl sürücüleri olarak iki türdedir. Kullandığınız sabit sürücü _________________ türündedir. Adım 2: Manyetik diske sahip sürücüler, bir motora bağlıdır ve bu motor yardımı ile dönmektedir. Motorun dönüş hızı, dakikadaki dönüş sayısı (Rpm) ile ifade edilir. Kullandığınız sabit sürücü _________________ Rpm dönüş sayısına sahiptir. Adım 3: Sabit sürücülerin depolayabileceği veri miktarı GB veya TB ile ölçülmektedir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Sabit Sürücü Türleri ve Özellikleri",
        "Chunk_ID":3134
    },
    {
        "ID":33,
        "Soru":"Sanal fabrika programlarının temel kısıtları nelerdir?",
        "İdeal Cevap (GT)":"Sanal fabrika programlarının temel kısıtları pahalı olması ve zaman isteyen uygulamalar olmasıdır. Ayrıca büyük ölçekli fabrikaların planlanması, kurulumu ve çalışması içindeki hiyerarşik düzenin yenilenmesi yıllar aldığı için, kısa sürede yapılan bir sanal fabrika yazılımı o fabrikadaki tüm gerçekleri yansıtamamaktadır.",
        "Bağlam (Context)":"Sanal fabrika programlarının kısıtları şunlardır: • Sanal fabrika programlarının pahalı olması ve zaman isteyen uygulamalar olması • Büyük ölçekli fabrikaların planlanması, kurulumu ve çalışması içindeki hiyerarşik düzenin yenilenmesi yıllar aldığı için kısa sürede yapılan bir sanal fabrika yazılımının o fabrikadaki tüm gerçekleri yansıtmaması Bu kısıtlara rağmen bu tür programlara gelecekte çok rağbet edileceği ve fabrikalar için faydalı olacağı öngörülmektedir. ’da bir fabrikaya ait sanal fabrika yazılımının ilgili model tasarımı verilmiş­ tir. Herhangi bir web 2.0 aracı kullanarak şekli oluşturunuz ve yorumlayınız. 2.24 2.25 : Motor sistemlerinde deneyler yapılmak için kullanılan dijital ikiz örneği : Bir fabrikaya ait sanal fabrika yazılımının ilgili model tasarımı 44 Dijital Dönüşüm 2.9.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Sanal Fabrika Programlarının Kısıtları ve Geleceği",
        "Chunk_ID":3008
    },
    {
        "ID":34,
        "Soru":"Ses kartlarının temel yapısında bulunan bileşenler nelerdir ve görevleri nedir?",
        "İdeal Cevap (GT)":"Ses kartlarının temel yapısında Dijital Sinyal İşlemci (DSP), Analog-Dijital Dönüştürücü (ADC), Dijital-Analog Dönüştürücü (DAC) ve Giriş-Çıkış Bağlantı Portları olmak üzere dört bileşen bulunmaktadır. Dijital Sinyal İşlemci (DSP) verileri işleyerek ses üretilmesini sağlayan bileşendir. Analog-Dijital Dönüştürücü (ADC) mikrofondan girilen ses sinyallerinin dijital sinyallere dönüştürülmesi işlemini gerçekleştiren bileşendir. Dijital-Analog Dönüştürücü (DAC) ses kartının işlediği ses sinyallerini analog sinyallere çevirerek çıkış portlarına gönderen bileşendir. Giriş ve Çıkış Bağlantı Portları ise mikrofon ve hoparlör bağlantısı yapılabilmesi için kullanılan bileşendir.",
        "Bağlam (Context)":"Kullanıcının ihtiyacına göre daha hassas tonlamaya sahip, daha net ve kaliteli ses üreten ses kartı satın alınarak anakarta takılabilir. Anakart üzerine genellikle PCI, PCIe veya USB portu üzerinden takılan ses kartları mevcuttur. ’de bir ses kartı görseli verilmiştir. 3.4.2.1. Ses Kartı Yapısı ve Çalışması Temel olarak ses kartlarının yapısında dört bileşen bulunmaktadır: Dijital Sinyal İşlemci (DSP): Verileri işleyerek ses üretilmesini sağlayan bileşendir. Anakatta tümleşik ses kartı kullanılıyorsa DSP desteği CPU üzerinden sunulmaktadır. Analog-Dijital Dönüştürücü (ADC): Mikrofondan girilen ses sinyallerinin dijital sinyallere dönüştürülmesi işlemini gerçekleştiren bileşendir. Dijital-Analog Dönüştürücü (DAC): Ses kartının işlediği ses sinyallerini analog sinyallere çevirerek çıkış portlarına gönderen bileşendir. Giriş ve Çıkış Bağlantı Portları: Mikrofon ve hoparlör bağlantısı yapılabilmesi için kullanılan bileşendir. Bazı ses kartları çok sayıda giriş ve çıkış bağlantısı içerir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Ses Kartı Yapısı ve Çalışması",
        "Chunk_ID":3108
    },
    {
        "ID":35,
        "Soru":"Siber saldırılardan korunmak için alınabilecek kişisel önlemler nelerdir?",
        "İdeal Cevap (GT)":"Siber saldırılardan korunmak için internet güvenlik paketi kullanmak, güçlü parolalar oluşturmak ve bilgisayardaki programları güncel tutmak gibi temel yöntemler izlenir. Ayrıca sosyal medya ayarlarını yönetmek, ağ paylaşımı ayarlarını güçlendirmek ve ailedeki bireyleri güvenli internet kullanımı hakkında bilgilendirmek de etkili bir koruma sağlar. Son olarak kimlik hırsızlığına karşı korunmaya yardımcı olacak önlemler alınması da güvenliği artırmaktadır.",
        "Bağlam (Context)":"Çünkü internet kullanan kişi sayısının gün be gün artması ve “hacker”ların (saldırgan) gün geçtikçe farklı yöntemler geliştirmesi güvenlik önlemlerini yetersiz kılmaktadır. Siber saldırı türlerinden bazıları şunlardır: phishing (e-dolandırıcılık), zararlı yazılımlar (trojan, virüs ve worm gibi), DDoS (ağ saldırıları), parola saldırıları... 2.37 2.38 : Popüler bir e-posta sayfasının bulut hizmeti : a) Bulut hizmetinden faydalanarak yazım, tablolama ve slayt programlarının çalıştırılması b) Slayt hazırlama programının görüntüsü (a) (b) 49 Dijital Dönüşüm Siber saldırı türleriyle ilgili her bir saldırı türü, bir slayt olacak şekilde açıklayıcı ve görsel bir sunum hazırlayınız (E-posta adresinizdeki bulut hesaptan slayt programını ya da bilgisayarınızdaki bir sunum programını kullanabilirsiniz.). Siber saldırılardan kişisel olarak korunmak için aşağıdaki önlemler alınabilir: • İnternet güvenlik paketi kullanmak • Güçlü parolalar kullanmak • Bilgisayardaki programları güncel tutmak • Sosyal medya ayarlarını yönetmek • Ağ paylaşımı ayarlarını güçlendirmek • Ailedeki bireyleri güvenli internet kullanımı için bilgilendirmek • Kimlik hırsızlığına karşı korunmaya yardımcı olacak önlemler almak Sosyal medyada siber şiddet yaşayan ünlüleri araştırarak ulaştığınız sonuçları bir yazım programına kaydediniz. Türkiye’de bilgi güvenliğinin sağlanması için 2016 yılında 6698 sayılı Kişisel Verilerin Korunması Kanunu (KVKK) yürürlüğe girmiştir. İnternette toplanan kişisel veriler, ilgili internet siteleri tarafından kaydedilmektedir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Siber Güvenlik ve Saldırı Türleri",
        "Chunk_ID":3025
    },
    {
        "ID":36,
        "Soru":"Ulusal Siber Olaylara Müdahale Merkezi (USOM) nedir?",
        "İdeal Cevap (GT)":"USOM, BTK bünyesinde kurulan Ulusal Siber Olaylara Müdahale Merkezi olup önemli altyapıların korunması ve siber tehlikeler için önlem alınmasını, herhangi bir dijital olay anında etkili bir müdahalenin yapılmasını sağlamaktadır.",
        "Bağlam (Context)":"Siber güvenlik konusu, dünyada tüm ülkelerin millî güvenliğin sağlanması ve kullanıcılara güvenli hizmet verilebilmesi amacıyla yoğunlukla üzerinde durduğu bir konudur. Avrupa Birliği’nin 2020 yılı hedefleri için yayımladığı 101 eylem adımı içinde 14 tanesi siber güvenlikle ilgilidir. Ülkemizde siber güvenliğin sağlanması için atılan en büyük adım BTK bünyesinde kurulan Ulusal Siber Olaylara Müdahale Merkezi (USOM) olmuştur. USOM; önemli altyapıların korunması ve siber tehlikeler için önlem alınmasını, herhangi bir dijital olay anında etkili bir müdahalenin yapılmasını sağlamaktadır.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Siber Güvenlik ve USOM",
        "Chunk_ID":3030
    },
    {
        "ID":37,
        "Soru":"Simülasyon modelinin oluşturulma aşamaları nelerdir?",
        "İdeal Cevap (GT)":"Simülasyon modelinin oluşturulma aşamaları şunlardır: sistemin açıklamasının oluşturulması, oluşturulacak modelin kurallarının belirlenmesi, elde edilen verilerin bir araya getirilerek düzenlenmesi, bilgisayar yazılımının algoritmasının elde edilmesi, model performansının ölçülmesi, model için önemli noktaların planlanması, denemelerin yapılması ve duyarlılık tahlilleri, uygulamaların yapılması ve sonuçların kanıtlanması. Bu aşamalar, simülasyon sürecinin düzenli ve etkili bir şekilde ilerlemesini sağlar.",
        "Bağlam (Context)":"Sistemin amaç ve hedefleri belirgin olmalıdır. Değişime açık olmalı ve basitten karmaşığa doğru giden bir model olmalıdır. Bir simülasyon modelinin oluşturulma aşamaları şunlardır: • Sistemin açıklamasının oluşturulması • Oluşturulacak modelin kurallarının belirlenmesi • Elde edilen verilerin bir araya getirilerek düzenlenmesi • Bilgisayar yazılımının algoritmasının elde edilmesi • Model performansının ölçülmesi • Model için önemli noktaların planlanması • Denemelerin yapılması ve duyarlılık tahlilleri • Uygulamaların yapılması ve sonuçların kanıtlanması : Sürücü kurslarında kullanılan direksiyon simülasyon sistemleri 2.18 2.19 2.20 42 Dijital Dönüşüm Sürücü kurslarında kullanılan direksiyon simülasyon sistemlerinin uygulanabilmesi için hangi simülasyon oluşturulma aşamalarının gerekli olduğunu açıklayınız. 2.8.1. Sanal Fabrika Sanal fabrika [VF (virtual factory)]; bir fabrika tesisindeki kritik işlemleri, nesneleri modellemek, simüle etmek (benzetme) ve optimize etmek (verimliliği arttırma) için bilgisayarların kullanılmasıdır. Sanal imalat, takım tezgâhlarını tasarlamanın ve test etmenin bir yolu olarak başlamış ve o zamandan beri üretim süreçlerini ve ürünleri kapsayacak şekilde genişlemiştir. 2.8.2 Dijital Fabrika Dijital fabrika; üretimde randımanı arttırarak araçların, malzemenin, yazılımsal birimlerin her zaman takibinin sağlanmasını ve müdahalenin mesafeli olarak bile yapılabilmesini sağlayan IoT (nesnelerin interneti) nesnelerinin yoğun kullanıldığı fabrika türleridir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Simülasyon Modeli Oluşturma Süreci",
        "Chunk_ID":3003
    },
    {
        "ID":38,
        "Soru":"Sosyal medyada uyulması gereken etik kurallar nelerdir?",
        "İdeal Cevap (GT)":"Sosyal medyada uyulması gereken etik kurallar arasında taraf tutmamak, yalan beyanda bulunmamak, toplumun değer yargılarıyla çatışmamak, başkaları hakkında asılsız beyanlarda bulunmamak, kendini farklı göstermemek, açık ve anlaşılır dil kullanmak ve bağlayıcı açıklamalardan kaçınmak vardır. Ayrıca, argo ve küfürden kaçınmak ile başkalarının özeline saygı duymak da önemli etik kurallar arasında yer almaktadır. Bu kurallar, sosyal medya kullanımında etik bir yaklaşım geliştirilmesine katkı sağlar.",
        "Bağlam (Context)":"Sosyal medyanın sık kullanılmasıyla birlikte birtakım kullanıcı odaklı sorunlar artış göstermiştir. Sosyal medya ağları, her ne kadar siber zorbalık ile ilgili görülen mesajların şikâyet edilmesi sistemini geliştirmiş olsa da bu sistemin çok etkili olmadığı gözlenmektedir. Sosyal medyada uyulması gereken etik kurallar şunlardır (): • Taraf tutmamak • Yalan beyanda bulunmamak • Toplumun değer yargılarıyla çatışmamak • Başkaları hakkında asılsız beyanlarda bulunmamak • Kendini farklı göstermemek • Açık ve anlaşılır dil kullanmak • Bağlayıcı açıklamalardan kaçınmak (Kişinin bağlı bulunduğu kurumu, grubu ya da zümreyi dâhil etmemek) : Sosyal medya etiği 18 Bilişim Etiği • Argo ve küfürden kaçınmak • Başkalarının özeline saygı duymak 1.1.5. İnternet Etiği İnternet etiği, gerçek hayatta kişilere gösterilen saygının internet ortamında da devam etmesidir. İnternet etiği ile ilgili yazılı olmayan kurallar şunlardır: • İnternet, kişilerin zararına kullanılmamalıdır. • Kişilerin yaptığı çalışmalar engellenmemelidir. • Başkalarının özel dosyalarına izinsiz erişim sağlanmamalıdır. • Doğruluğu kanıtlanmamış bilgiler desteklenmemelidir. • Yazılımlar lisanslı olarak kullanılmalıdır. • Kişilere ait elektronik iletişim kaynakları onların haberi olmadan kullanılmamalıdır. • İletişim ortamında kullanılacak dilin neden olacağı sorunlar önceden düşünülerek uygun bir dil kullanılmalıdır. Bilişim etiği kavramına uygun olmayan durumlarla ilgili Gör­ sel 1.3’e benzer bir görsel ma­ teryal hazırlayınız. sadece ba­ sit bir örnektir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Sosyal Medya ve Etik Sorunlar",
        "Chunk_ID":2933
    },
    {
        "ID":39,
        "Soru":"Sıkışmış piksel nedir ve kullanıcı deneyimini nasıl etkileyebilir?",
        "İdeal Cevap (GT)":"Sıkışmış piksel, piksel üzerinde görüntüyü oluşturan üç renkten biri veya daha fazlasının açık kalması durumunda piksel renginin akışkan ekran görüntüsüyle birlikte değişmemesi olayıdır. Kullanıcı deneyimini etkileyen sıkışmış pikseller, sayıları ve ekrandaki konumlarına bağlı olarak, ekranın estetik görünümünü bozabilir ve görüntü kalitesini olumsuz yönde etkileyebilir. Özellikle belirli bölgelerde yoğunlaşması durumunda, sıkışmış pikseller kullanıcıların dikkatini dağıtabilir ve görsel deneyimi azaltabilir.",
        "Bağlam (Context)":"Eğer piksel üzerinde görüntüyü oluşturan üç renkten biri veya daha fazlası açık kalırsa piksel rengi akan ekran görüntüsüyle birlikte değişmez. Piksel renginin sabit kalması olayına sıkışmış piksel adı verilir. ’de ekranda oluşan sıkışmış piksel görüntüsü verilmiştir. Sayılarına ve ekrandaki konumlarına bağlı olarak ölü ve \/ veya sıkışmış pikseller kullanıcı deneyimini etkileyebilir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Sıkışmış Piksel Sorunu",
        "Chunk_ID":3194
    },
    {
        "ID":40,
        "Soru":"IP protokolü nedir ve temel özellikleri nelerdir?",
        "İdeal Cevap (GT)":"IP, veri paketlerinin yönlendirilebilmesine imkân veren adres bilgisi ve bazı kontrol bilgilerini içeren bağlantısız bir ağ protokolüdür. IP, paket içeriklerinin doğruluğunu garanti etmez ve sadece başlık kısmında oluşan hataları bulup düzeltir. Ağ üzerinde haberleşecek her sistem birer IP adresi kullanırken, iletim garantisi taşıma katmanı protokolü olan TCP ile sağlanır.",
        "Bağlam (Context)":"TCP \/ IP ise daha uygulanabilir bir model olduğu için daha çok uygulamaya yöneliktir. ’de OSI ve TCP \/ IP katmanları arasında ilişki görülmektedir. IP, veri paketlerinin yönlendirilebilmesine imkân veren adres bilgisi ve bazı kontrol bilgilerini içeren protokoldür. Ağ üzerinde haberleşecek her sistem birer IP adresi kullanır. IP, bağlantısız (connectionless) bir ağ protokolüdür. Paket içeriklerinin doğruluğunu garanti etmez. IP katmanı sadece başlık kısmında oluşan hataları bulur ve düzeltir. İletimin garantisi, taşıma katmanı protokolü olan TCP ile sağlanır. Uygulama katmanında yer alan programlar, IP katmanına doğrudan ulaşamaz. IP ve programlar arasındaki bağlantı iki protokol tarafından sağlanır. Bu protokoller, TCP ve UDP’dir [user datagram protocol (kullanıcı datagram protokolü).",
        "Bloom Seviyesi":"Remembering",
        "Konu":"TCP\/IP Protokolü ve IP Adresleme",
        "Chunk_ID":3535
    },
    {
        "ID":41,
        "Soru":"Tasarım kavramı nedir ve hangi algı türlerini temel alır?",
        "İdeal Cevap (GT)":"Tasarım, bir nesnenin dış görünümü ile ilgili özellikler ve fikirlerdir. Tasarım öncelikle kişilerin görsel algılarını baz alırken diğer algılara yönelik de olabilir.",
        "Bağlam (Context)":"Sizler de bu şekilde bir buluşa ve faydalı modele örnek veriniz. Verdiğiniz örnekleri materyal şeklinde, “paint” tarzı herhangi bir resim programında ’teki gibi oluşturunuz. 1.4.5. Tasarım Tasarım, bir nesnenin dış görünümü ile ilgili özellikler ve fikirlerdir. Tasarım öncelikle kişilerin görsel algılarını baz alırken diğer algılara yönelik de olabilir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Tasarım Kavramı ve Görsel Örnek Oluşturma",
        "Chunk_ID":2956
    },
    {
        "ID":42,
        "Soru":"Lise Öğrencileri Araştırma Projeleri Yarışması raporunda yer alması gereken Proje Özeti bölümünün özellikleri nelerdir?",
        "İdeal Cevap (GT)":"Proje Özeti bölümünde proje hakkında genel bir fikir oluşturacak kısa ve anlaşılır bir metin yazılmalıdır. Özetin tamamı 150 ile 250 kelime arasında olmalıdır.",
        "Bağlam (Context)":"Öğrencilerin bu haktan faydalanmak için TÜBİTAK’a başvurmaları gerekmektedir. Düşünmeyi, gözlem yapmayı, merak ettiklerini araştırmayı seven ve üreten öğrenciler için proje yazmak ve gerçekleştirmek güç değildir. Öğrenciler için gerekli olan şey kendine güvenmek ve fikirlerinin özgünlüğünü kontrol edecek bir danışman öğretmenle çalışmaktır. 2.49 TEMATİK ALANLAR Akıllı Ulaşım Sistemleri Algoritma\/Mantıksal Tasarım Bilim Tarihi Biyoçeşitlilik Biyotaklit(Biyomimikri) Büyük Veri Değerler Eğitimi Dijital Dönüşüm Doğal Afetler ve Afet Yönetimi Giyilebilir Teknolojiler Ekolojik Denge Finansal Okuryazarlık Havacılık ve Uzay Göç ve Uyum Görsel ve İşitsel Sanatlar Malzeme ve Nanoteknoloji İnsan Hakları ve Demokrasi Kültürel Miras Milli Teknoloji Hamlesi Medya Okuryazarlığı Nesnelerin İnterneti Robotik ve Kodlama Sağlıklı Beslenme Sağlık Teknolojileri STEAM Su Okuryazarlığı Sürdürülebilir Kalkınma Tarım Teknolojileri ve Seracılık Yapay Zeka Yenilenebilir Enerji 55 Dijital Dönüşüm Bir Lise Öğrencileri Araştırma Projeleri Yarışması Raporu Nasıl Yazılır? Proje Adı: Proje çalışması hakkında genel bir fikir oluşturan tek bir cümle (mümkünse 12 kelimeyi geçmeyen) olmalıdır. 1. 2. Proje Özeti: Her projenin proje hakkında genel bir fikir oluşturacak kısa ve anlaşılır bir özeti yazılma­ lıdır. Özetin tamamı 150-250 kelime arasında olmalıdır. Proje Amacı: Bu bölümde doğrudan projenin hedefi, somut amaçları ve içeriği dikkate alınmalıdır. 3. 4.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"TÜBİTAK Öğrenci Projeleri ve Başvuru Süreci",
        "Chunk_ID":3043
    },
    {
        "ID":43,
        "Soru":"Yapısal kablolama el aletleri ve montaj malzemeleri nelerdir ve her birinin kullanımı nedir?",
        "İdeal Cevap (GT)":"Yapısal kablolama el aletleri arasında çakma (Krone) pensesi mevcut olup, ağ kablolarının prize ve patch panelin arka kısmındaki keystone jak girişlerine sabitlenmesi için kullanılır. Montaj malzemeleri ise plastik kelepçeler, plastik halkalar ve helezoni hortumlardan oluşur; plastik kelepçeler kabloların dağılmasını önlemek için tek kullanımlık olarak kullanılırken, plastik halkalar ağ cihazlarına bağlanan kabloların etiketlenmesi için kullanılır ve üzerinde rakamlar bulunur. Helezoni hortumlar ise kabloların yoğun olduğu yerlerde görüntü kirliliğini önlemek ve kabloları düzenlemek amacıyla kullanılır.",
        "Bağlam (Context)":"7.4.2.2. Yapısal Kablolama El Aletleri Yapısal kablolama sırasında, kablolamada kullanılan el aletlerinin yanı sıra özel amaçlı el aletleri de kullanılmaktadır. 7.4.2.2.1. Çakma (Krone) Pensesi Ağ kablolarının prize ve patch panelin arka kısmında bulunan keystone olarak adlandırılan jak girişlerine sabitlenmesi için çakma pensesi kullanılır. ’te bağlantı işlemi için kullanılan pabuçlama pensesi görülmektedir. 7.4.2.3. Montaj Malzemeleri Kabloların kabinet içerisinde düzenlenmesi ve gruplandırılması amacıyla çeşitli malzemeler kullanılabilir. Plastik kelepçe, plastik halkalar ve helezoni hortumlar en çok kullanılan malzemelerden birkaçıdır. • Plastik kelepçeler kabloların dağılmasını önlemek için kullanılır. Yalnız bir kez kullanılabilir. • Plastik halkalar patch panel ya da switch, router gibi ağ cihazlarına bağlanan kabloların etiketlenmesi için üzerinde rakamlar bulunan halkalardır. • Helezoni bez parçaları ya da helezoni hortumlar, kabloların yoğun olduğu yerlerde görüntü kirliliğini önlemek ve kabloları düzenlemek için kullanılır. Yapısal kablolama sisteminde anahtar cihazı ile iki bilgisayar arasında veri iletim ortamı oluşturulacaktır. Yapısal kablolama sistemini oluşturunuz, çalışmasını test ediniz.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Yapısal Kablolama Aletleri",
        "Chunk_ID":3615
    },
    {
        "ID":44,
        "Soru":"Yapısal kablolama sisteminin kurulumu sırasında kullanılan araç ve gereçler nelerdir?",
        "İdeal Cevap (GT)":"Yapısal kablolama sisteminin kurulumunda bir adet kategori patch panel, 10 metre uzunluğunda UTP kablo, iki adet 1 metre uzunluğunda patch cord kablo, mini kablo soyucu, çakma pensesi, kablo test cihazı, plastik numaratör halkaları ve iki adet bilgisayar kullanılır.",
        "Bağlam (Context)":"Yapısal kablolama sistemini oluşturunuz, çalışmasını test ediniz. Gerçekleştirdiğiniz işlem adımlarını yazınız. Araç Gereçler • Bir adet kategori patch panel • 10 metre uzunluğunda UTP kablo, iki adet 1 metre uzunluğunda patch cord kablo • Mini kablo soyucu, çakma pensesi, kablo test cihazı • Plastik numaratör halkaları • İki adet bilgisayar : Yapısal kablolama : Çakma (krone) pensesi 7.4 Dış Donanım Birimleri Ağ Temelleri 235 Adım 1: Adım 2: Adım 3: Adım 4: Adım 5: Adım 6: Adım 7: Adım 8: Değerlendirme Yapısal kablolama sistemiyle anahtar cihazı ile iki bilgisayar arasında veri iletişimi faaliyeti aşağıdaki listede yer alan ölçütlere göre değerlendirilecektir. Çalışmanızı yaparken bu ölçütleri dikkate alınız. ÖLÇÜTLER EVET HAYIR Kablo uçlarını numaralandırır. Kablo soyucu ile kablo kılıfını açar (1,7-2 cm arasında). Bükümlü telleri patch paneldeki jaka (bağlantı şemasına uygun olarak) dizer. Kablo tellerini pense yardımıyla jaka sabitler. Kablo uçlarını prize takar ve pense ile sabitler. Test cihazı ile priz ve patch panel arasındaki bağlantıyı test eder.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Yapısal Kablolama Sistemi Kurulumu",
        "Chunk_ID":3616
    },
    {
        "ID":45,
        "Soru":"Yapısal kablolama sisteminin temel amacı ve avantajları nelerdir?",
        "İdeal Cevap (GT)":"Yapısal kablolama sisteminin temel amacı, bir kurumun ses, veri ve görüntü iletim gereksinimlerini karşılamak için esnek ve yönetilebilir bir altyapı sunmaktır. Bu sistemin avantajları arasında performansın artması, hata bulma süresinin kısalması ve gelecekteki genişlemelere kolay uyum sağlanması yer alır.",
        "Bağlam (Context)":"Yapısal kablolama sistemini oluşturunuz, çalışmasını test ediniz. Gerçekleştirdiğiniz işlem adımlarını yazınız. Araç Gereçler • Bir adet kategori patch panel • 10 metre uzunluğunda UTP kablo, iki adet 1 metre uzunluğunda patch cord kablo • Mini kablo soyucu, çakma pensesi, kablo test cihazı • Plastik numaratör halkaları • İki adet bilgisayar : Yapısal kablolama : Çakma (krone) pensesi 7.4 Dış Donanım Birimleri Ağ Temelleri 235 Adım 1: Adım 2: Adım 3: Adım 4: Adım 5: Adım 6: Adım 7: Adım 8: Değerlendirme Yapısal kablolama sistemiyle anahtar cihazı ile iki bilgisayar arasında veri iletişimi faaliyeti aşağıdaki listede yer alan ölçütlere göre değerlendirilecektir. Çalışmanızı yaparken bu ölçütleri dikkate alınız. ÖLÇÜTLER EVET HAYIR Kablo uçlarını numaralandırır. Kablo soyucu ile kablo kılıfını açar (1,7-2 cm arasında). Bükümlü telleri patch paneldeki jaka (bağlantı şemasına uygun olarak) dizer. Kablo tellerini pense yardımıyla jaka sabitler. Kablo uçlarını prize takar ve pense ile sabitler. Test cihazı ile priz ve patch panel arasındaki bağlantıyı test eder.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Yapısal Kablolama Sistemi Kurulumu",
        "Chunk_ID":3616
    },
    {
        "ID":46,
        "Soru":"Yazıcıların teknik özellikleri nelerdir ve bu özelliklerin önemi nedir?",
        "İdeal Cevap (GT)":"Yazıcıların teknik özellikleri arasında çözünürlük, baskı hızı, kâğıt boyutu ve gramajı, çip, toner, mürekkep tankı ve bağlantı arabirimi gibi kavramlar bulunur. Bu kavramların bilinmesi, yazıcı seçim kriterlerini oluşturma açısından önemlidir; çünkü bu özellikler, kullanıcıların ihtiyaçlarına en uygun yazıcıyı seçmelerine yardımcı olur. Özellikle çözünürlük, baskı kalitesinin temel bir ölçütü olarak dikkat çekmektedir.",
        "Bağlam (Context)":"YAZICILAR Yazıcılar, bilgisayarda işlenen verileri kâğıda dökmek için kullanılan çıkış aygıtlarıdır. Bilgisayarda yazılan bir metni kâğıda dökme işlemine çıktı denir. Yazdırma işlemi, kâğıt haricinde asetat film yüzeyine de yapılabilir. Günümüzde 3D yazıcıların yaygınlaşmasıyla bilgisayarda hazırlanan tasarımların nesnelere dönüşmesi kolaylaşmıştır. 4.3.1. Yazıcı Temel Kavramları Yazıcıların teknik özellikleri belirtilirken çözünürlük, baskı hızı, kâğıt boyutu ve gramajı, çip, toner, mürekkep tankı, bağlantı arabirimi gibi kavramlar kullanılır. Bu kavramların bilinmesi, yazıcı seçim kriterlerini oluşturma açısından önemlidir. 4.3.1.1. Çözünürlük Yazıcılarda çözünürlük ölçü birimi dpi’dir (dot per inch). Dpi, inç başına nokta anlamına gelir ve baskı kalitesinin temel bir ölçüsüdür. ’de dpi ile görüntü arasındaki ilişki görülmektedir. Dpi değeri arttıkça yazıcı daha net ve ayrıntılı bir çıktı verir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"Yazıcılar ve Çalışma Prensipleri",
        "Chunk_ID":3239
    },
    {
        "ID":47,
        "Soru":"İşlemci soketi nedir ve temel türleri hangi işlemcilerle uyumludur?",
        "İdeal Cevap (GT)":"İşlemci soketi, işlemcinin takıldığı yuvadır ve işlemciyi sabitlemek için kilitli bir mandal mekanizması bulunmaktadır. Temel türleri arasında Soket 478 eski Pentium ve Celeron işlemciler için, Soket 754 Sempron ve bazı Athlon işlemciler için, Soket 775 dual core işlemciler için, Soket AM4 yeni tip Athlon işlemciler için ve Soket 1151\/1366\/vb. i3, i5 ve i7 işlemciler için geliştirilmiştir.",
        "Bağlam (Context)":"3.1.6.1. İşlemci Soketi İşlemcinin takıldığı yuvadır. İşlemciyi sabitlemek için kilitli bir mandal mekanizması bulunmaktadır. Anakart ve işlemci teknolojilerine göre bazı türleri bulunmaktadır: • Soket 478: Eski Pentium (Pentiyum) ve Celeron (Seleron) işlemciler için geliştirilmiştir. • Soket 754: Sempron ve bazı Athlon işlemciler için geliştirilmiştir. • Soket 775: Dual core [dual kor (çift çekirdek)] işlemciler için geliştirilmiştir. • Soket AM4: Yeni tip Athlon işlemciler için geliştirilmiştir. • Soket 1151\/1366\/vb.: i3, i5 ve i7 işlemciler için geliştirilmiştir. Anakart ve üzerine bağlanan işlemcinin birbirini desteklemesi gerekir. Bununla beraber seçilen işlemciye uygun sokete sahip bir anakart seçilmesi gerekmektedir. Aksi takdirde işlemci, sokete uymayacaktır. 3.1.6.2.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"İşlemci Soketi Türleri",
        "Chunk_ID":3071
    },
    {
        "ID":48,
        "Soru":"BIOS kavramını tanımlayınız ve ayar arayüzüne erişim nasıl sağlanır?",
        "İdeal Cevap (GT)":"Temel giriş \/ çıkış sistemi anlamına gelen BIOS, işletim sistemi ve donanım kaynakları arasındaki bütün bağımsız sürücü kaynaklarını yönetir. Anakart içerisine üretici firma tarafından yerleştirilen gömülü bir yazılım olan BIOS ayar arayüzüne erişebilmek için bilgisayarın güç düğmesine bastıktan sonra klavyedeki genellikle F2 veya nadiren DEL tuşuna basmak gerekir.",
        "Bağlam (Context)":") uygulama yazılımları olarak adlandırılır (). KULLANICI DONANIM UYGULAMA YAZILIMLARI : Donanım, yazılım ve kullanıcı seviyesi İşletim Sistemleri ve Kurulum 147 5.1. İŞLETİM SİSTEMİ KURULUM ÖNCESİ AÇILIŞ AYARLARI İşletim sisteminin doğru bir şekilde kurulabilmesi için BIOS ve POST kavramlarının bilinmesi, gerekli ayarlama işlemlerinin yapılması ve hata mesajlarının bilinmesi gerekmektedir. 5.1.1. BIOS Temel giriş \/ çıkış sistemi anlamına gelen BIOS (basic input \/ output system), işletim sistemi ve donanım kaynakları arasındaki bütün bağımsız sürücü kaynaklarını yönetir. Anakart içerisine üretici firma tarafından yerleştirilen yani gömülü olarak gelen bir yazılımdır. Her anakartın BIOS yazılımı farklı arayüze sahip olabilir. Bir bilgisayara işletim sistemi yükleneceği zaman “BIOS ayar (BIOS setup)” arayüzü üzerinden çeşitli ayarlamaların yapılması gerekir. BIOS ayar arayüzüne erişebilmek için bilgisayarın güç düğmesine bastıktan sonra klavyedeki (genellikle) F2 veya (nadiren) DEL tuşuna basmak gerekir. Bu tuşlar anakart üreticisine göre zaman zaman farklılık gösterebilir.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"İşletim Sistemi Kurulumu ve BIOS Ayarları",
        "Chunk_ID":3337
    },
    {
        "ID":49,
        "Soru":"İşletim sistemleri ne tür bir görevi üstlenir ve donanım aygıtları üzerinden nasıl görüntülenürler?",
        "İdeal Cevap (GT)":"İşletim sistemleri, diğer yazılımların çalışabileceği bir platform görevini üstlenir. İşletim sistemine yüklü olan donanım aygıtlarını \"Olay Görüntüleyicisi\" üzerinden görebiliriz.",
        "Bağlam (Context)":"2. (…..) İşletim sistemleri, diğer yazılımların çalışabileceği bir platform görevini üstlenir. 3. (…..) Bilgisayar açma düğmesine basıldığı anda ilk çalışan işletim sistemi BIOS’tur. (…..) UEFI BIOS’larda “mouse” kullanımına izin verilmez. 4. 5. (…..) İşletim sistemine yüklü olan donanım aygıtlarını “Olay Görüntüleyicisi” üzerinden görebiliriz. 6. (…..) İşletim sistemi yüklemek için mutlaka bir flaş sürücüye ihtiyaç duyarız. (…..) Ofis programı işletim sisteminin çalışması için gerekli bir yazılımdır. 7. B. soruların doğru cevabını işaretleyiniz.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"İşletim Sistemi Temel Bilgileri",
        "Chunk_ID":3430
    },
    {
        "ID":50,
        "Soru":"Bilgisayar sistemleri hangi ana gruplara ayrılır?",
        "İdeal Cevap (GT)":"Bilgisayar sistemleri donanım ve yazılım olmak üzere iki ana gruba ayrılır.",
        "Bağlam (Context)":"1. Günlük yaşantınızdan bildiğiniz işletim sistemleri var mı? Araştırınız. Hangi tür cihazlarda işletim sistemleri bulunur? Araştırınız. 2. İşletim sistemleri ücretli mi yoksa ücretsiz mi olmalıdır? Nedenlerini söyleyiniz. 3. Yerli bir işletim sistemini kişiselleştirebilseniz hangi özellikleri eklemek ve kaldırmak isterdiniz? Sebebini söyleyerek açıklayınız. 4. Kullandığınız herhangi bir elektronik aygıtta sorun meydana geldi mi? Açıklayınız. Soruna nasıl çözüm buldunuz? Açıklayınız. 5. Günlük yaşantınızda gerek duyabileceğiniz yazılımlar nelerdir? Sebebini söyleyerek açıklayınız. 5. İŞLETİM SİSTEMLERİ Bilgisayar sistemleri donanım ve yazılım olmak üzere iki ana gruba ayrılır.",
        "Bloom Seviyesi":"Remembering",
        "Konu":"İşletim Sistemleri ve Sorunlar",
        "Chunk_ID":3335
    },
    {
        "ID":51,
        "Soru":"İstemci bilgisayar sunucu bilgisayara SYN adlı bir istek paketi göndermezse işlem adımlarında ne olur?",
        "İdeal Cevap (GT)":"İstemci bilgisayar, sunucu bilgisayara SYN adlı bir istek paketi göndermezse sunucu, bağlantı açmaz ve veri iletimi işlemi gerçekleştirilmez. Bu durumda, SYN + ACK adı verilen onay paketi geri gönderilemez ve bağlantı tamamlanamaz.",
        "Bağlam (Context)":"Çalışmada uyuma ve düzene önem verir. Zamanı verimli ve iyi kullanır. Dış Donanım Birimleri Ağ Temelleri 220 Bu bağlantı yönteminde gerçekleştirilen işlem adımları şu şekildedir: 1. İstemci bilgisayar, sunucu bilgisayara SYN (synchronize) adlı bir istek paketi gönderir. 2. Sunucu bilgisayar, istek için bir bağlantı açar ve SYN + ACK (synchronize + acknowledged) adı verilen bir onay paketini geri gönderir.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Ağ Bağlantı Yöntemleri",
        "Chunk_ID":3559
    },
    {
        "ID":52,
        "Soru":"Bir ağ yöneticisi, bir cihazın otomatik adres bilgilerini görüntülemek istiyorsa ne yapmalı ve bu bilginin önemi nedir?",
        "İdeal Cevap (GT)":"Ağ yöneticisi, ipconfig komutunu kullanarak cihazın otomatik adres bilgilerini görüntülemelidir. Bu bilgi, cihazın ağdaki kimliğini ve diğer ağ bileşenleriyle olan iletişim durumunu anlamak için önemlidir. Çünkü ipconfig komutu, ağa bağlı cihazların IP adresi, alt ağ maskesi ve varsayılan ağ geçidi gibi bilgileri sağlar ve bu bilgiler ağ yönetimi ve sorun giderme süreçlerinde kritik rol oynar. Ayrıca, düzenli olarak bu bilgilerin kontrol edilmesi, ağın düzgün çalışıp çalışmadığını değerlendirmek için gereklidir.",
        "Bağlam (Context)":"Kartın otomatik adres bilgilerini görüntüler (ipconfig komutu). Çalışmada uyuma ve düzene önem verir. Zamanı verimli ve iyi kullanır. Dış Donanım Birimleri Ağ Temelleri 246 A. cümlelerin başındaki boşluğa cümle doğru ise “D” yanlış ise “Y” yazınız. 1. (…..) Seri iletişimde saniyede iletilen toplam bit sayısına baud hızı denir. 2. (…..) Seri iletim kendi içinde senkron ve asenkron iletim olmak üzere ikiye ayrılır.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Ağ İletişim Temelleri",
        "Chunk_ID":3643
    },
    {
        "ID":53,
        "Soru":"Klasik veri işleme yazılımları kullanılmaya devam edilirse büyük verinin hacim özelliğinden kaynaklanan temel sorun ne olur?",
        "İdeal Cevap (GT)":"Büyük veri hacim olarak çok büyük olduğundan içerisinden faydalı bilginin seçilmesi için klasik veri işleme yazılımları kullanılamaz. Bu durum, büyük verinin içinden faydalı bilginin seçilememesine neden olur.",
        "Bağlam (Context)":"Örneğin “Türkiye millî futbol takımı Avrupa Şampiyonası’nda bir öncekine göre daha çok puan toplamıştır.” ifadesi gibi. ’da yer alan bilgi hiyerarşisi pirami­ dindeki noktalı yerlere “bilgi”, “veri” ve “en­ formasyon” kelimelerini uygun sıralamayla yazınız. İnternette günden güne artan ve biriken veri yığınları büyük veri olarak bilinmektedir. Büyük veri, ha­ cim olarak çok büyük olduğundan içerisinden faydalı bilginin seçilmesi için klasik veri işleme yazılımları kullanılamaz. Büyük verinin İngilizcede 3V [volume (volyum), variety (verayıti), velocity (vilasiti)] olarak bilinen özellikleri vardır: • Hacim (Volume): Verilerin kapladığı alandır. • Çeşitlilik (Variety): Büyük veriler farklı kaynaklardan ve biçimlerden veri içerebilmektedir. • Hız (Velocity): Verilerin internet ortamında çok hızlı bir şekilde artmasından dolayı verilerin toplanması, saklanması, işlenmesi ve analiz edilmesi kısa bir sürede olmalıdır. Veri madenciliği, büyük hacimli veriler arasında bilgiye ulaşma veya bilgiyi farklı yöntemlerle bulma işidir.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Bilgi ve Veri Hiyerarşisi",
        "Chunk_ID":2993
    },
    {
        "ID":54,
        "Soru":"Bir bilgisayar açıldıktan sonra donma ve işlem süresinde artma sorunlarıyla karşılaşıldığında, kullanıcı hangi adımları izlemelidir ve neden?",
        "İdeal Cevap (GT)":"Kullanıcı, bilgisayar açıldıktan sonra donma ve işlem süresindeki artış gibi sorunlarla karşılaştığında, öncelikle sistem geri yükleme yapmalıdır. Sistem geri yükleme, işletim sisteminin daha önce düzgün çalıştığı bir zamana döndürülmesini sağlar ve bu işlem, kullanıcı belgelerine zarar vermez. Ayrıca, BIOS'un güncellenmesi de bir çözüm yolu olarak değerlendirilebilir çünkü güncel BIOS, sistemin performansını etkileyen hataları düzeltebilir. Bu adımlar, yüklü yazılımların düzgün çalışmasını sağlamak ve performans sorunlarını gidermek için önemlidir.",
        "Bağlam (Context)":"Bilgisayar yeniden açılarak sorun kontrol edilir. Örnek: copy d:\\i386 tldr c:\\ • BIOS güncellenir. Bilgisayar yeniden açılarak sorun kontrol edilir. 5.8.1.2. Açılış Sonrası Sorunlar İşletim sistemi yüklendikten sonra kullanıcının isteklerini yerine getirmek için çalışan işletim sisteminde donmalar, işlem süresinde artma, performans düşüşü ve yüklü yazılımların açılmaması gibi sorunlar meydana gelebilir. Bu gibi sorunlar karşısında yapılacak işlemler şunlardır: • Sistem Geri Yükleme Yapmak: Sistem geri yükleme, işletimin sisteminin çalışması ile ilgili herhangi bir sorunun olmadığı daha önceki bir zamana geri döndürme işlemi olarak tanımlanabilir. Bu işlem, kullanıcı belgelerine herhangi bir zarar vermez. Sistem dosyalarını ve yüklenen yazılımları 5.23 Dış Donanım Birimleri İşletim Sistemleri ve Kurulum 176 etkileyen bir işlem gerçekleştirir.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Bilgisayar Sorun Giderme Yöntemleri",
        "Chunk_ID":3417
    },
    {
        "ID":55,
        "Soru":"Aygıtın uygun sürücüye sahip olmadığı durumlarda donanım kimlik bilgilerine nasıl ulaşılır?",
        "İdeal Cevap (GT)":"Sorunlu aygıtın üzerine mouse'un sağ tuşuyla tıklanır ve açılan menüden \"Özellikler\" sekmesi seçilir. \"Genel\" sekmesinin iki sağıında olan \"Ayrıntılar\" sekmesine tıklanır ve Özellik etiketinin altındaki açılır menüden \"Donanım Kimlikleri\" seçeneğine tıklanır. Değer etiketinin altında bu donanıma ait kimlik numaraları listelenmektedir.",
        "Bağlam (Context)":"a. b. Bu durumda işletim sistemi uygun sürücüyü otomatik olarak arayacak ve kuracaktır. Aksi durumda ise ’deki pencere gösterilecektir. Bu sorunu çözmek için tekrar sorunlu aygıtın üzerine “mouse”un sağ tuşuyla tıklanır ve açılan menüden “Özellikler” sekmesi seçilir. “Genel” sekmesi altında aygıt için uygun sürücü olmadığını ve hata kodunu gösteren aygıt durumu alanı görülebilir. Bu pencere açıkken “Genel” sekmesinin iki sağında olan “Ayrıntılar” sekmesine tıklanır. Özellik etiketinin altındaki açılır menüden “Donanım Kimlikleri” seçeneğine tıklanır. Değer etiketinin altında bu donanıma ait kimlik numaraları listelenecektir.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Donanım Sürücü Sorunu ve Çözümü",
        "Chunk_ID":3379
    },
    {
        "ID":56,
        "Soru":"Kablosuz klavyelerde radyo frekansı teknolojisi yerine kızılötesi teknolojisi kullanılırsa mesafe etkinliği nasıl etkilenir?",
        "İdeal Cevap (GT)":"Radyo frekansı teknolojisine dayalı klavyeler, kızaötesine göre daha uzun mesafelerde kullanılabilir. Bu nedenle, kızılötesi teknolojisi ile kablosuz klavye kullanıldığında mesafe kısıtlaması yaşanacaktır.",
        "Bağlam (Context)":"4.11 140 Dış Donanım Birimleri A. cümlelerin başındaki boşluğa cümle doğru ise “D” yanlış ise “Y” yazınız. 1. (…..) Kablosuz klavyelerde bağlantı birimi, klavye alıcı ve verici devresinden oluşmaktadır. (…..) Radyo frekansı teknolojisine dayalı klavyeler kızılötesine göre daha uzun mesafelerde kullanılabilir. 2. 3. (…..) F klavye kullanılan bir bilgisayara Q klavye takıldığında işletim sisteminden klavye tipiyle ilgili bir ayar yapmak gerekmez. 4. (…..) Lazer farelerin çözünürlüğü fazla olduğundan yüzeydeki mikroskobik parçaları algılamaz ve bu parçalar farenin çalışmasında herhangi bir problem oluşturmaz. 5.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Dış Donanım Birimleri Eğitimi",
        "Chunk_ID":3317
    },
    {
        "ID":57,
        "Soru":"Açık kaynak işletim sisteminde ekran çözünürlük değerini değiştirmek için hangi uygulama adımları izlenir?",
        "İdeal Cevap (GT)":"Panel düğmesine tıklandıktan sonra açılan menü penceresinde önce “Ayarlar” ve sonrasında “Görüntüle” seçeneği seçilir. “Görüntüle” penceresi içerisinde “Çözünürlük” kısmına gelinerek bu kısımda çözünürlük değerlerinin yer aldığı seçim kutusu üzerinden işlem yapılır.",
        "Bağlam (Context)":"“ClearType” özelliğini kullanarak metni daha net görecek şekilde görüntüyü ayarlayınız. 4. Bilgisayarınızda birden çok uygulamayı ekranı dörde veya ikiye bölerek aynı anda görebilirsiniz. Bu konuyu araştırarak ekranınızda iki tane uygulamanın aynı anda konuşlanmasını sağlayınız. 6.1.2.2. Açık Kaynak Sisteminde Ekran Çözünürlüğü Açık kaynak işletim sisteminde de kapalı kaynak işletim sisteminde olduğu gibi ekran çözünürlük değeri değiştirilebilmektedir. Açık kaynak işletim sisteminde ekran çözünürlük değerini değiştirmek için aşağıdaki uygulama adımlarını izleyiniz. Adım 1: Panel düğmesine (başlat) tıklayınız. Adım 2: Açılan menü penceresinde önce “Ayarlar” ve sonrasında “Görüntüle” seçeneğini seçiniz. Adım 3: ’de görülen “Görüntüle” penceresi içerisinde “Çözünürlük” kısmına geliniz. Bu kısımda çözünürlük değerlerinin yer aldığı seçim kutusu bulunmaktadır.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Ekran Ayarları ve Görüntü Yönetimi",
        "Chunk_ID":3459
    },
    {
        "ID":58,
        "Soru":"Disk bölümünde bir yanlışlık olduğunda GRUB ekranını göremezseniz ne olur?",
        "İdeal Cevap (GT)":"Eğer GRUB ekranını göremezseniz tahminde bulunduğunuz disk bölümünde bir yanlışlık olduğu anlamına gelir. Yeni bir seçim yapıp yukarıdaki işlemleri tekrarlamalısınız.",
        "Bağlam (Context)":"Loading Operating System … error : file ‘\/boot\/grub\/i386-pc\/crypto.mod ’ not found. Enterprise rescue mode … grub rescue> Adım 2: Örneğin tahmininiz listelenen disk bölümlerinden “msdos2” olsun. grub rescue> set prefix=(hd0, msdos2)\/boot\/grub grub rescue> set root=hd0, msdos2 grub rescue> insmod normal grub rescue> normal 5.24 : Olay görüntüleyicisi ile gerçekleşen olayların detayları elde edilebilir. Dış Donanım Birimleri İşletim Sistemleri ve Kurulum 178 komutlarını sırasıyla çalıştırınız. Bu işlemlerden sonra eğer GRUB ekranını göremezseniz tahminde bulunduğunuz disk bölümünde bir yanlışlık olduğu anlamına gelir. Yeni bir seçim yapıp yukarıdaki işlemleri tekrarlayınız.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Grub Kurtarma Modu İşlemleri",
        "Chunk_ID":3423
    },
    {
        "ID":59,
        "Soru":"Halka topolojisinde herhangi bir kablo veya düğüm arızalanırsa ne olur?",
        "İdeal Cevap (GT)":"Halka topolojisinde herhangi bir kablo veya düğüm arızalanırsa bağlantı bozulur. Bu, mesajların daire boyunca ilerlemesini engeller, çünkü mesajlar daire boyunca aynı yönde ilerlemektedir.",
        "Bağlam (Context)":"Halka Topolojisi (Ring Topology) Bu topolojide düğümler bir daire etrafında uçtan uca bağlıdır. Herhangi bir kablo veya düğüm arızalanırsa bağlantı bozulur. Halka topolojisinde mesajlar daire boyunca aynı yönde ilerler (Saat yönünde veya saat yönünün tersine etkilidir.). FDDI, SONET veya token ring protokolleri kullanılır. Halka topolojisinde fiber optik veya çift bükümlü kablo kullanılabilir. Ancak en çok çift bükümlü kablo tercih edilir. ’te halka topolojisine ait bağlantı diyagramı görülmektedir. Bu topolojide genelde token ring protokolü kullanılır. Token (jeton, 3 baytlık), düğümler arasında dolaşan bilgidir. Bu jeton ağda dolanır.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Halka Topolojisi Açıklaması",
        "Chunk_ID":3511
    },
    {
        "ID":60,
        "Soru":"Yazıcıda 64-105 gr\/m2 gramajındaki ofis kâğıdı yerine 150-300 gr\/m2 gramajındaki fotoğraf kâğıdı kullanılırsa ne olur?",
        "İdeal Cevap (GT)":"Yüksek gramaja sahip fotoğraf kâğıdı yerleştirildiğinde yazdırma işlemi sırasında kâğıt, yazıcı içerisinde sıkışabilir. Diğer taraftan daha hafif bir kâğıt kullanıldığında ise yazıcı kâğıt mekanizması, kâğıdı çekemeyebilir veya birden fazla kâğıt çekebilir.",
        "Bağlam (Context)":"Genel olarak ofis ya da fotokopi kâğıdı olarak ifade edilen kâğıt türü 64-105 gr\/m2 gramaj değerinde üretilir. Fotoğraf kâğıt türü ise 150-300 gr\/m2 arasında gramaj değerine sahiptir. Yazıcıdan baskı alınabilecek kâğıt aralık değerleri yazıcı kullanım kılavuzunda belirtilir. Yüksek gramaja sahip fotoğraf kâğıdı yerleştirildiğinde yazdırma işlemi sırasında kâğıt, yazıcı içerisinde sıkışabilir. Diğer taraftan daha hafif bir kâğıt kullanıldığında ise yazıcı kâğıt mekanizması, kâğıdı çekemeyebilir veya birden fazla kâğıt çekebilir. 4.3.1.4. Çip Akıllı yonga olarak da adlandırılan çipler, yazıcı sarf (tüketim) malzemesi olan toner veya kartuş düzeylerini izlemek için kullanılır. Çipler sarf malzeme üzerine yerleştirilmiştir. Yazdırılan kâğıt sayısı ve yazdırma özellikleri çiplerde saklanabilir. ’da toner üzerinde yer alan çip görülmektedir.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Kâğıt Türleri ve Yazıcı Kullanımı",
        "Chunk_ID":3243
    },
    {
        "ID":61,
        "Soru":"Kenar aydınlatma yerine doğrudan aydınlatma teknolojisi kullanıldığında görsel performans ve tasarım açısından ne gibi farklılıklar oluşur?",
        "İdeal Cevap (GT)":"Doğrudan aydınlatma kullanıldığından çok yüksek kontrast oranlarına ulaşılabiliyorken kenardan aydınlatma teknolojisinde de çok ince tasarımlar yapabilmek mümkündür.",
        "Bağlam (Context)":"Aradaki fark, arka aydınlatmada bir dizi ışık yayan diyot kullanılmasıdır. Ekrandaki görüntüyü oluşturan her bir piksel için ışık, bu LED’ler aracılığıyla gönderilir. Bu nedenle de daha net ve aydınlık bir görüntü sunmaktadır. LED ekran, panel aydınlatmalarına göre doğrudan [D-LED (direct LED)] ve kenar aydınlatma [E-LED (edge)] olmak üzere ikiye ayrılabilir. Doğrudan aydınlatmada panelin tamamının altında ışık yayan diyotlar dizilidir. Kenar aydınlatmada ise LCD’nin kenarlarına yerleştirilmiştir. Doğrudan aydınlatma kullanıldığından çok yüksek kontrast oranlarına ulaşılabiliyorken kenardan aydınlatma teknolojisinde de çok ince tasarımlar yapabilmek mümkündür.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"LED Ekran Teknolojisi",
        "Chunk_ID":3205
    },
    {
        "ID":62,
        "Soru":"Lazer yazıcılarda çözünürlük değiştirilebilirken, LED yazıcılarda bu işlem neden yapılamaz?",
        "İdeal Cevap (GT)":"LED yazıcılar sabit LED adedi ve boyutları nedeniyle sabit bir çözünürlüğe sahiptir. Lazer yazıcılarda ise lazer nokta boyutu değiştirilerek çözünürlük değiştirilebilir.",
        "Bağlam (Context)":"LED yazıcılarda ise yanan LED’lerin birine yakınlığı ışıkta hafif farklılıklar gösterebilir. LED yazıcılar sabit LED adedi ve boyutları nedeniyle sabit bir çözünürlüğe sahiptir. Lazer yazıcılarda ise lazer nokta boyutu değiştirilerek çözünürlük değiştirilebilir. 4.3.2.5. 3D (Üç Boyutlu) Yazıcılar 1984 yılında geliştirilen 3D yazıcı teknolojisi, hızlı ve düşük maliyetli örnek model oluşturmak için geliştirilmiştir. 2005 yılında “RepRap” isimli proje neticesinde parça tasarımı ve yazılımı açık kaynak olarak bir 3D yazıcı üretilmiş ve “RepRap 3D yazıcı” olarak isimlendirilmiştir. Bu yazıcılar, 3D yazıcıların geniş bir kesimde kullanım imkânı bulmasını sağlamıştır. 3D yazıcılar, farklı baskı teknolojilerini kullanır. Bu teknolojiler SLA, DLP, SLS, FDM olarak sıralanabilir. FDM [fused deposition modeling (eriyik yığma modelleme)], cihaz ve baskı maliyeti açısından en çok tercih edilen baskı teknolojisidir. ’da FDM teknolojisini kullanan 3D yazıcı görülmektedir.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"LED ve Lazer Yazıcı Teknolojileri",
        "Chunk_ID":3252
    },
    {
        "ID":63,
        "Soru":"FDM baskı teknolojisi diğer 3D yazıcı teknolojilerine göre neden daha fazla tercih edilir?",
        "İdeal Cevap (GT)":"FDM teknolojisi cihaz ve baskı maliyeti açısından en çok tercih edilen baskı teknolojisidir. 3D yazıcılar, SLA, DLP, SLS ve FDM gibi farklı baskı teknolojilerini kullanır.",
        "Bağlam (Context)":"LED yazıcılarda ise yanan LED’lerin birine yakınlığı ışıkta hafif farklılıklar gösterebilir. LED yazıcılar sabit LED adedi ve boyutları nedeniyle sabit bir çözünürlüğe sahiptir. Lazer yazıcılarda ise lazer nokta boyutu değiştirilerek çözünürlük değiştirilebilir. 4.3.2.5. 3D (Üç Boyutlu) Yazıcılar 1984 yılında geliştirilen 3D yazıcı teknolojisi, hızlı ve düşük maliyetli örnek model oluşturmak için geliştirilmiştir. 2005 yılında “RepRap” isimli proje neticesinde parça tasarımı ve yazılımı açık kaynak olarak bir 3D yazıcı üretilmiş ve “RepRap 3D yazıcı” olarak isimlendirilmiştir. Bu yazıcılar, 3D yazıcıların geniş bir kesimde kullanım imkânı bulmasını sağlamıştır. 3D yazıcılar, farklı baskı teknolojilerini kullanır. Bu teknolojiler SLA, DLP, SLS, FDM olarak sıralanabilir. FDM [fused deposition modeling (eriyik yığma modelleme)], cihaz ve baskı maliyeti açısından en çok tercih edilen baskı teknolojisidir. ’da FDM teknolojisini kullanan 3D yazıcı görülmektedir.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"LED, Lazer ve 3D Yazıcılar",
        "Chunk_ID":3252
    },
    {
        "ID":64,
        "Soru":"Bir yerel ağda aynı MAC adresine sahip iki cihaz bulunması durumunda ne tür sorunlar ortaya çıkabilir ve bu sorunları nasıl önlemek gerekir?",
        "İdeal Cevap (GT)":"Aynı MAC adresine sahip iki cihazın yerel ağda bulunması, veri iletiminde çakışmalara neden olur ve ağda ciddi iletişim sorunları yaratır. Cihazlar, hangi MAC adresine veri gönderileceği konusunda kararsız kalır ve bu durum, veri paketlerinin kaybolmasına veya yanlış cihazlara iletilmesine yol açabilir. Bu tür sorunları önlemek için her Ethernet kartının benzersiz bir MAC adresine sahip olması sağlanmalıdır, böylece ağda güvenilir bir iletişim ortamı oluşturulur ve her cihazın kimliği net bir şekilde belirlenir. Ayrıca, yazılımlar aracılığıyla MAC adreslerinin yanlışlıkla değiştirilmesi durumunda, bu değişikliklerin dikkatle izlenmesi ve düzeltilmesi de önemlidir.",
        "Bağlam (Context)":"Ethernet kartlarında, 48 bit uzunluğundaki MAC adresleri kullanılır. Her bir Ethernet kartının tek ve benzersiz bir MAC adresi vardır. Bu adres, cihazın kimliği niteliğinde olup ağda diğer cihazlardan ayrılmasını sağlayan öneme sahiptir. MAC adresleri yazılımlar ile değiştirilebilmektedir. Yerel ağlarda veri iletimi genellikle MAC adresi üzerinden gerçekleştirilir. Bu yüzden ağ üzerinde aynı MAC adresini kullanan cihazlar olamaz. 7.5.2.1. Ethernet Kartı Çalışması Ethernet üzerinden veriler paketler hâlinde iletilir.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"MAC Adresleri ve Ethernet Kartları",
        "Chunk_ID":3638
    },
    {
        "ID":65,
        "Soru":"Monitör ile bilgisayar arasındaki bağlantı noktaları ile bilgisayar girişleri uyumlu değilse ne yapılmalıdır?",
        "İdeal Cevap (GT)":"Bağlantı noktaları ile bilgisayar girişleri aynı veya dönüştürücü kullanılarak uyumlu olması gerekmektedir.",
        "Bağlam (Context)":"En büyük dezavantajları ise üretim maliyetlerinin diğer ekranlara göre fazla olmasıdır. 4.2.1.3. Monitör Bağlantı Arabirimleri Monitör bağlantı arabirimleri, monitör ile bilgisayar arasındaki iletişimi gerçekleştiren yapılardır. Bağlantı noktaları ile bilgisayar girişleri aynı veya dönüştürücü kullanılarak uyumlu olması gerekmektedir.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Monitör Bağlantı Arabirimleri",
        "Chunk_ID":3209
    },
    {
        "ID":66,
        "Soru":"Sistem belleğinin aşırı kullanılması durumunda bilgisayarın performansı ve çalışma durumu nasıl etkilenir?",
        "İdeal Cevap (GT)":"Sistem belleğinin aşırı kullanılması, bilgisayar performansını düşürebilir ve hatta bilgisayarın kilitlenmesine neden olabilir. Bilgisayar teknolojisinde, bir bilgisayarın RAM'i ne kadar fazlaysa bilgisayardan o kadar fazla performans beklenmektedir.",
        "Bağlam (Context)":"Ayrıca elektrik kesintisi olduğunda da RAM üzerindeki tüm bilgiler silinir. Bilgisayar teknolojisinde, bir bilgisayarın RAM'i ne kadar fazlaysa bilgisayardan o kadar fazla performans beklenmektedir. RAM bellekler sadece elektrik olduğu sürece verileri üzerinde depolayabilen, elekt­ rik kesintisi hâlinde tüm bilgilerin silindiği bir bellek türüdür. Sistem belleğinin aşırı kullanılması, bilgisayar performansını düşürebilir ve hatta bilgisayarın kilitlenmesine neden olabilir. : İşlemci ile RAM bellek arasındaki veri alışverişi blok yapısı 76 İç Donanım Birimleri RAM belleğin kapasitesini ölçmek için “bayt” ölçü birimi kullanılır. 1 Bayt (B) = 8 Bit 1 Kilobayt (KB) = 1.024 Bayt 1 Megabayt (MB) = 1.024 KB = 1.048.576 Bayt 1 Gigabayt (GB) = 1.024 MB = 1.073.741.824 Bayt 1 Terabayt (TB) = 1.024 GB = 1.099.511.627.776 Bayt Yaygın olarak kullanılan RAM türleri şunlardır: SRAM: Statik rastgele erişimli bellektir. Önceleri işlemcinin içindeki önbelleği oluşturmak için kullanılmıştır. Daha çok devrelere entegre durumdadır. DRAM: Dinamik rastgele erişimli bellektir. Sürekli yenileme gerektiren bellek hücrelerine sahiptir. Günümüzde pek fazla kullanılmamaktadır. SDRAM: Senkron dinamik rastgele erişimli bellektir. Performansı büyük miktarda arttırmak için seri çekim modundan yararlanan bellek çeşididir. DDR SDRAM: Çift veri hızı eş zamanlı dinamik RAM çeşididir. SDRAM gibi çalışır ancak daha yüksek bant genişliğine sahiptir. Bu nedenle daha yüksek hızda çalışabilir. Günümüzde en yaygın kullanılan bellek türüdür. DDR2, DDR3, DDR4 ve DDR5 gibi çeşitleri vardır. Bu RAM çeşitlerinin pim uçları birbiri ile uyumlu olmadığı için yuvaları farklıdır. Bu RAM’lerin çalışma hızları şöyledir: • DDR2 RAM’ler 400-1.066 MHz arasında çalışma hızına sahiptir. • DDR3 RAM’ler 800-2.133 MHz arasında çalışma hızına sahiptir. • DDR4 RAM’ler 1.600-3.200 MHz arasında çalışma hızına sahiptir. • DDR5 RAM’ler 3.200-6.400 MHz arasında çalışma hızına sahiptir (2020 yılı sonunda üre...",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"RAM Belleğin Temel Özellikleri ve Performans Etkisi",
        "Chunk_ID":3102
    },
    {
        "ID":67,
        "Soru":"Sistem belleğinin aşırı kullanılması durumunda bilgisayar performansında ne tür değişiklikler meydana gelir?",
        "İdeal Cevap (GT)":"Sistem belleğinin aşırı kullanılması bilgisayar performansını düşürebilir ve hatta bilgisayarın kilitlenmesine neden olabilir. Ayrıca bilgisayar teknolojisinde bir bilgisayarın RAM'i ne kadar fazlaysa bilgisayardan o kadar fazla performans beklenmektedir.",
        "Bağlam (Context)":"Ayrıca elektrik kesintisi olduğunda da RAM üzerindeki tüm bilgiler silinir. Bilgisayar teknolojisinde, bir bilgisayarın RAM'i ne kadar fazlaysa bilgisayardan o kadar fazla performans beklenmektedir. RAM bellekler sadece elektrik olduğu sürece verileri üzerinde depolayabilen, elekt­ rik kesintisi hâlinde tüm bilgilerin silindiği bir bellek türüdür. Sistem belleğinin aşırı kullanılması, bilgisayar performansını düşürebilir ve hatta bilgisayarın kilitlenmesine neden olabilir. : İşlemci ile RAM bellek arasındaki veri alışverişi blok yapısı 76 İç Donanım Birimleri RAM belleğin kapasitesini ölçmek için “bayt” ölçü birimi kullanılır. 1 Bayt (B) = 8 Bit 1 Kilobayt (KB) = 1.024 Bayt 1 Megabayt (MB) = 1.024 KB = 1.048.576 Bayt 1 Gigabayt (GB) = 1.024 MB = 1.073.741.824 Bayt 1 Terabayt (TB) = 1.024 GB = 1.099.511.627.776 Bayt Yaygın olarak kullanılan RAM türleri şunlardır: SRAM: Statik rastgele erişimli bellektir. Önceleri işlemcinin içindeki önbelleği oluşturmak için kullanılmıştır. Daha çok devrelere entegre durumdadır. DRAM: Dinamik rastgele erişimli bellektir. Sürekli yenileme gerektiren bellek hücrelerine sahiptir. Günümüzde pek fazla kullanılmamaktadır. SDRAM: Senkron dinamik rastgele erişimli bellektir. Performansı büyük miktarda arttırmak için seri çekim modundan yararlanan bellek çeşididir. DDR SDRAM: Çift veri hızı eş zamanlı dinamik RAM çeşididir. SDRAM gibi çalışır ancak daha yüksek bant genişliğine sahiptir. Bu nedenle daha yüksek hızda çalışabilir. Günümüzde en yaygın kullanılan bellek türüdür. DDR2, DDR3, DDR4 ve DDR5 gibi çeşitleri vardır. Bu RAM çeşitlerinin pim uçları birbiri ile uyumlu olmadığı için yuvaları farklıdır. Bu RAM’lerin çalışma hızları şöyledir: • DDR2 RAM’ler 400-1.066 MHz arasında çalışma hızına sahiptir. • DDR3 RAM’ler 800-2.133 MHz arasında çalışma hızına sahiptir. • DDR4 RAM’ler 1.600-3.200 MHz arasında çalışma hızına sahiptir. • DDR5 RAM’ler 3.200-6.400 MHz arasında çalışma hızına sahiptir (2020 yılı sonunda üre...",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"RAM Belleğin Özellikleri ve Performans Etkisi",
        "Chunk_ID":3102
    },
    {
        "ID":68,
        "Soru":"Veri madenciliği sürecinde verilerin sanal gerçeklikle görselleştirilmesi hangi analitik avantajı sağlar?",
        "İdeal Cevap (GT)":"Veri madenciliğinin veri analizi aşamasında verilerin sanal gerçeklikle görselleştirilmesi, analiz sonuçlarının daha iyi yorumlanmasını sağlamaktadır. Sanal makineler fiziksel olmayan sadece yazılım ortamında var olan makinelerdir ve sanal gerçekliğin veri görselleştirilmesinde kullanımı veri madenciliği için çok önemlidir.",
        "Bağlam (Context)":"Sanal makineler fiziksel olmayan sadece yazılım ortamında var olan makinelerdir. Sanal gerçekliğin veri görselleştirilmesinde kullanımı veri madenciliği için çok önemlidir. ’de de görüldüğü üzere veri madenciliğinin veri analizi aşamasında verilerin sanal gerçeklikle görselleştirilmesi, analiz sonuçlarının daha iyi yorumlanmasını sağlamaktadır.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Sanal Gerçeklik ve Veri Madenciliği",
        "Chunk_ID":2998
    },
    {
        "ID":69,
        "Soru":"Sanayi devriminin hızlı bir şekilde ülkelere yayılmasında demir yolu ağlarının gelişmesinin rolü nedir?",
        "İdeal Cevap (GT)":"Üretimin artmasında ve sanayi devriminin hızlı bir şekilde ülkelere yayılmasındaki en önemli etken, demir yolu ağlarının gelişmesi ve ulaşımın bu yollardan sağlanması olmuştur.",
        "Bağlam (Context)":"Üretimin artmasında ve sanayi devriminin hızlı bir şekilde ülkelere yayılmasındaki en önemli etken, demir yolu ağlarının gelişmesi ve ulaşımın bu yollardan sağlanması olmuştur. Birinci sanayi devriminde “burjuva” adı verilen eğitimli, zengin, kentli kişiler ile işçi sınıfları meydana gelmiştir. Sanayi devrimi farklı dinî, siyasi, bilimsel ve felsefi düşüncelerin de ortaya çıkmasına neden olmuştur. Bu düşüncelerden biri de “Bugün çok çalışıp yarını düşünmek” ifadesi ile öne çıkan Protestan reformudur. Sanayi çağında bilimsel yöntem ve rasyonel düşünme ilkeleri özellikle Napolyon aracılığıyla tüm Avrupa’ya yayılmıştır. Birinci sanayi devrimini hazırlayan en önemli etken Rönesans ve reform hareketleridir.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Sanayi Devrimi'nin Etkileri",
        "Chunk_ID":2967
    },
    {
        "ID":70,
        "Soru":"Saat darbesi (clock pulse) kullanılmazsa senkron seri iletimde veri iletimi nasıl etkilenir?",
        "İdeal Cevap (GT)":"Saat darbesi kullanılmadığında veri bitlerinin belirlenen zaman periyotlarında eş zamanlı olarak gönderilmesi sağlanamaz. Veri hattına ek olarak saat hattı bağlanmadığı için alıcı ve verici aynı clock ile beslenemez ve verinin doğru olarak iletilmesi garanti altına alınamaz.",
        "Bağlam (Context)":"Bu yöntemde bir saat darbesi (clock pulse) kullanılır. Saat darbesi, veri bitlerinin belirlenen zaman periyotlarında eş zamanlı olarak gönderilmesini sağlar. ’de iki sistemin senkron seri iletimi görülmektedir. Veri (data) hattına ek olarak bir de saat (clock) hattı bağlanmıştır. Alıcı ve verici aynı “clock” ile beslendiği için verinin doğru olarak iletilmesi garanti altına alınmıştır. Önce gönderici, her iki tarafın da anlamını bildiği iletişime başlatma karakterini gönderir. Alıcı, bu karakteri aldığında iletişim başlar.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Senkron Seri İletim Yöntemi",
        "Chunk_ID":3491
    },
    {
        "ID":71,
        "Soru":"Bir cihazda veri iletimi sırasında hızın artırılması gereken bir durumla karşılaşıldığında, hangi iletim yöntemi tercih edilmelidir ve neden?",
        "İdeal Cevap (GT)":"Bu durumda paralel iletim yöntemi tercih edilmelidir çünkü paralel iletimde birden fazla bit, aynı anda bir saat darbesi hızında iletilir. Bu sayede, veri gönderiminde yüksek hız sağlanır ve verilerin iletilmesi için birden fazla giriş ve çıkış hattı kullanılır. Diğer iletim yöntemleri ise, verileri tek tek ilettiği için daha yavaş bir performans sergiler. Bu nedenle, veri iletim hızının kritik olduğu durumlarda paralel iletişim kullanılması idealdir.",
        "Bağlam (Context)":"Araştırınız. Tek, çift ve yarı çift yönlü seri iletim yöntemleri nasıl çalışır? Araştırınız. Aralarında ne gibi farklar bulunmaktadır? Araştırınız. : Senkron seri iletim : Asenkron seri iletişim Araştırma Araştırma Araştırma Dış Donanım Birimleri Ağ Temelleri 204 7.1.2.2. Paralel İletim Birden fazla bit, bir saat darbesi hızında aynı anda birlikte iletilir. Verilerin gönderilmesi için çeşitli giriş ve çıkış hatları kullanıldığından hızlı bir şekilde iletim yapılır.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Seri ve Paralel İletim Yöntemleri",
        "Chunk_ID":3494
    },
    {
        "ID":72,
        "Soru":"Bir ülkenin sağlık bakanlığı ağına bağlı kritik hastane sistemlerinde eş zamanlı olarak birçok kullanıcı erişiminde kesinti ve veri bütünlüğü şüphesi oluşmuştur, hangi kurumun koordinasyonunda önlem alınmalı ve etkin müdahale nasıl sağlanmalıdır?",
        "İdeal Cevap (GT)":"USOM; önemli altyapıların korunması ve siber tehlikeler için önlem alınmasını, herhangi bir dijital olay anında etkili bir müdahalenin yapılmasını sağlamaktadır. Ülkemizde siber güvenliğin sağlanması için atılan en büyük adım BTK bünyesinde kurulan Ulusal Siber Olaylara Müdahale Merkezi (USOM) olmuştur. Siber güvenlik konusu, dünyada tüm ülkelerin millî güvenliğin sağlanması ve kullanıcılara güvenli hizmet verilebilmesi amacıyla yoğunlukla üzerinde durduğu bir konudur. Avrupa Birliği’nin 2020 yılı hedefleri için yayımladığı 101 eylem adımı içinde 14 tanesi siber güvenlikle ilgilidir.",
        "Bağlam (Context)":"Siber güvenlik konusu, dünyada tüm ülkelerin millî güvenliğin sağlanması ve kullanıcılara güvenli hizmet verilebilmesi amacıyla yoğunlukla üzerinde durduğu bir konudur. Avrupa Birliği’nin 2020 yılı hedefleri için yayımladığı 101 eylem adımı içinde 14 tanesi siber güvenlikle ilgilidir. Ülkemizde siber güvenliğin sağlanması için atılan en büyük adım BTK bünyesinde kurulan Ulusal Siber Olaylara Müdahale Merkezi (USOM) olmuştur. USOM; önemli altyapıların korunması ve siber tehlikeler için önlem alınmasını, herhangi bir dijital olay anında etkili bir müdahalenin yapılmasını sağlamaktadır.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Siber Güvenlik ve USOM",
        "Chunk_ID":3030
    },
    {
        "ID":73,
        "Soru":"Ulusal Siber Olaylara Müdahale Merkezi (USOM) kullanılmadığında hangi problemler ortaya çıkar?",
        "İdeal Cevap (GT)":"Ulusal Siber Olaylara Müdahale Merkezi (USOM) kullanılmadığında, önemli altyapıların korunması ve siber tehlikeler için önlem alınması zayıflar. Ayrıca, herhangi bir dijital olay anında etkili bir müdahalenin yapılması sağlanamaz ve bu durum, siber güvenlik risklerini artırır.",
        "Bağlam (Context)":"Siber güvenlik konusu, dünyada tüm ülkelerin millî güvenliğin sağlanması ve kullanıcılara güvenli hizmet verilebilmesi amacıyla yoğunlukla üzerinde durduğu bir konudur. Avrupa Birliği’nin 2020 yılı hedefleri için yayımladığı 101 eylem adımı içinde 14 tanesi siber güvenlikle ilgilidir. Ülkemizde siber güvenliğin sağlanması için atılan en büyük adım BTK bünyesinde kurulan Ulusal Siber Olaylara Müdahale Merkezi (USOM) olmuştur. USOM; önemli altyapıların korunması ve siber tehlikeler için önlem alınmasını, herhangi bir dijital olay anında etkili bir müdahalenin yapılmasını sağlamaktadır.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Siber Güvenlik Önemi ve Önlemler",
        "Chunk_ID":3030
    },
    {
        "ID":74,
        "Soru":"Monitörün desteklediği çözünürlük ile ekran kartının desteklediği çözünürlük arasında uyumsuzluk olduğunda görüntü kalitesi nasıl etkilenir?",
        "İdeal Cevap (GT)":"Monitör çözünürlük değerleri ekran paneli ve bilgisayar ekran kartı teknik özellikleri dikkate alınarak belirlenir. Örneğin 1.920 x 1.080 çözünürlük desteğine sahip bir monitörde bilgisayar ekran kartı en fazla 1.280 x 720 çözünürlüğü desteklemektedir. Bu durumda monitörde görüntülenebilecek görüntü 1.280 x 720 olur.",
        "Bağlam (Context)":"Örneğin “1.024 × 768” ifadesi, genişliğin 1.024 piksel ve yüksekliğin 768 piksel olduğu anlamına gelir. Tablo 4.1’de monitör ve diğer görüntüleme (projeksiyon cihazı vb.) aygıtlarına ait standart çözünürlük değerleri ve ekran oranları görülmektedir. Tablo 4.1: Standart Çözünürlük ve Ekran Oranları VGA 640 480 4:3 0,307 WVGA 768 480 16:10 0,368 WVGA 720 480 3:2 0,345 WVGA 800 480 5:3 0,384 FWVGA ≈854 480 16:9 0,410 SVGA 800 600 4:3 0,480 WSVGA 1.024 576 16:9 0,590 WSVGA 1.024 600 128:75 0,614 DVGA 960 640 3:2 0,614 XGA 1.024 768 4:3 0,786 HD 1.280 720 16:9 0,922 WXGA 1.280 800 16:10 1,024 HD + 1.600 900 16:9 1,440 FHD 1.920 1.080 16:9 2,074 WUXGA 1.920 1.200 16:10 2,304 QHD 2.560 1.440 16:9 3,686 QHD + 3.200 1.800 16:9 5,760 4K UHD 3.840 2.160 16:9 8,294 5K 5.120 2.880 16:9 14,746 8K UHD 7.680 4.320 16:9 33,170 16K QUHD 15.360 8.640 16:9 132,710 Monitör çözünürlük değerleri, ekran paneli ve bilgisayar ekran kartı teknik özellikleri dikkate alınarak belirlenir. Örneğin 1.920 x 1.080 çözünürlük desteğine sahip bir monitörde bilgisayar ekran kartı en fazla 1.280 x 720 çözünürlüğü desteklemektedir. Bu durumda monitörde görüntülenebilecek görüntü 1.280 x 720 olur. törün ekran ölçüleri görülmektedir.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Standart Çözünürlük ve Ekran Oranları",
        "Chunk_ID":3187
    },
    {
        "ID":75,
        "Soru":"Kablo üzerindeki uzunluk değeri, ağ yönetiminde hangi pratik kolaylığı sağlar?",
        "İdeal Cevap (GT)":"Kablo üzerindeki uzunluk değeri, ağda kullanılan kablo miktarını ölçme ve istenilen uzunlukta kablo parçaları oluşturma açısından fayda sağlar. Bu değer, birer metre aralıkla artarak kullanılan kablonun metre cinsinden uzunluğunu belirtir.",
        "Bağlam (Context)":"TP kablo üzerinde çeşit, kategori, standart ve uzunluk bilgileri belirtilebilir. ’da kablo üzerinde yazılı kısımlar görülmektedir. Çift 1: Beyaz-Mavi, Mavi Çift 2: Beyaz-Turuncu, Turuncu Çift 3: Beyaz-Yeşil, Yeşil Çift 4: Beyaz-Kahverengi, Kahverengi : STP kablo : TP kablo bilgileri Araştırma Dış Donanım Birimleri Ağ Temelleri 229 Tablo 7.6: TP Kablo Standartları Aşağıda ’da verilen kablonun kısımları ve açıklamaları verilmiştir: • TP Çeşidi: Kablo, UTP (korumasız bükümlü çiftlenmiş) çeşidi bir kablodur. • Kategori: Kablo, kategori 6 (Cat.6) veri iletim standardına göre üretilmiştir. • Kablo Standartları: Kablo, ISO \/ IEC 11801 ve TIA \/ EIA PVC standartlarına uygun üretilmiştir. • Uzunluk: Kullanılan kablonun metre cinsinden uzunluğudur. Kablo üzerinde uzunluk değeri, birer metre aralıkla artar. Bu değer, ağda kullanılan kablo miktarını ölçme ve istenilen uzunlukta kablo parçaları oluşturma açısından fayda sağlayabilir. Kablo kılıfı, ceket olarak da ifade edilir. Farklı uygulamalar için tasarlanmış ceket türleri vardır. Bu türler yangına karşı kablonun gösterdiği direnci ve yanma durumunda çıkardığı tehlikeli gaz ve duman oranını ifade eder. Ceketler PVC, CM, CMR ve CMP gibi isimler alır. Atölye ağ sisteminizde kullanılan çift bükümlü kablo çeşidi nedir? Kablo etiket bilgilerini inceleyerek edindiğiniz bilgileri sınıfınızla paylaşınız. 7.4.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"TP Kablo Çift Renkleri ve Standartları",
        "Chunk_ID":3600
    },
    {
        "ID":76,
        "Soru":"Kablo üzerindeki uzunluk bilgisinin birer metre aralıkla belirtilmemesi durumda ağda kullanılan kablo miktarını ölçmek veya istenilen uzunlukta kablo parçaları oluşturmak nasıl etkilenir?",
        "İdeal Cevap (GT)":"Kullanılan kablonun metre cinsinden uzunluğu, kablo üzerinde birer metre aralıkla artan değerlerle belirtilmezse ağda kullanılan kablo miktarını ölçme ve istenilen uzunlukta kablo parçaları oluşturma açısından fayda sağlanamaz.",
        "Bağlam (Context)":"TP kablo üzerinde çeşit, kategori, standart ve uzunluk bilgileri belirtilebilir. ’da kablo üzerinde yazılı kısımlar görülmektedir. Çift 1: Beyaz-Mavi, Mavi Çift 2: Beyaz-Turuncu, Turuncu Çift 3: Beyaz-Yeşil, Yeşil Çift 4: Beyaz-Kahverengi, Kahverengi : STP kablo : TP kablo bilgileri Araştırma Dış Donanım Birimleri Ağ Temelleri 229 Tablo 7.6: TP Kablo Standartları Aşağıda ’da verilen kablonun kısımları ve açıklamaları verilmiştir: • TP Çeşidi: Kablo, UTP (korumasız bükümlü çiftlenmiş) çeşidi bir kablodur. • Kategori: Kablo, kategori 6 (Cat.6) veri iletim standardına göre üretilmiştir. • Kablo Standartları: Kablo, ISO \/ IEC 11801 ve TIA \/ EIA PVC standartlarına uygun üretilmiştir. • Uzunluk: Kullanılan kablonun metre cinsinden uzunluğudur. Kablo üzerinde uzunluk değeri, birer metre aralıkla artar. Bu değer, ağda kullanılan kablo miktarını ölçme ve istenilen uzunlukta kablo parçaları oluşturma açısından fayda sağlayabilir. Kablo kılıfı, ceket olarak da ifade edilir. Farklı uygulamalar için tasarlanmış ceket türleri vardır. Bu türler yangına karşı kablonun gösterdiği direnci ve yanma durumunda çıkardığı tehlikeli gaz ve duman oranını ifade eder. Ceketler PVC, CM, CMR ve CMP gibi isimler alır. Atölye ağ sisteminizde kullanılan çift bükümlü kablo çeşidi nedir? Kablo etiket bilgilerini inceleyerek edindiğiniz bilgileri sınıfınızla paylaşınız. 7.4.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"TP Kablo Çiftleri ve Standartları",
        "Chunk_ID":3600
    },
    {
        "ID":77,
        "Soru":"Çözünürlük değeri arttıkça taranan dokümanın hafızada kapladığı alan nasıl değişir?",
        "İdeal Cevap (GT)":"Çözünürlük değeri arttıkça doküman üzerinde taranan nokta sayısı artar ve taranan doküman hafızada daha az yer kaplar.",
        "Bağlam (Context)":"Tambur, baskı resminin negatifini oluşturur. 16. (…..) LED ve lazer yazıcıların ortak özelliği, tamburu aydınlatmak için her ikisinin de LED kullanmasıdır. 17. (…..) FDM teknolojisine sahip 3D yazıcılarda sarf malzeme olarak filament kullanılır. 18. (…..) Tarama işleminde elde edilen dijital sinyalin bilgisayarda görüntülenmesi veya saklanabilmesi için analog sinyale dönüştürülmesi gerekir. 19. (…..) Günümüzde en çok kullanılan tarayıcılardan biri çok fonksiyonlu yazıcı (all in one) olup tarama, kopyalama ve faks gönderme özelliklerine sahiptir. 20. (…..) Tarama işleminde renk derinliği arttıkça tarama kalitesi artar. 21. (…..) Tarayıcılarda, çözünürlük değeri arttıkça doküman üzerinde taranan nokta sayısı da artar ve taranan doküman hafızada daha az yer kaplar. ÖLÇME VE DEĞERLENDİRME 141 Dış Donanım Birimleri 22. (…..) Tarayıcılar, dokümanın ince bir satır hâlinde ışıklandırılıp yansıyan ışığın algılanması prensibi ile çalışır. 23. (…..) Diyafram ışık yoğunluğunun fazla olması durumunda kısılır, az olması durumunda da açılarak genişler.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Yazıcı ve Tarayıcı Teknolojileri",
        "Chunk_ID":3321
    },
    {
        "ID":78,
        "Soru":"Fotoğrafın sadece ekranda görüntülenmesi yerine basım amacıyla taranması durumunda sistem üzerindeki etkileri nelerdir?",
        "İdeal Cevap (GT)":"Dergi, kitap gibi basımlarda fotoğraf en az 300 dpi çözünürlükte taranmalıdır. Çözünürlük değeri arttıkça tarama süresi ve oluşan dosya boyutu artar. Dolayısıyla tarama sonucu oluşturulan dosyanın bilgisayar belleğinde kapladığı alan da artar.",
        "Bağlam (Context)":"Tarayıcılarda, çözünürlük değeri arttıkça doküman üzerinde taranan nokta sayısı da artar ve veri miktarı büyür. Dolayısıyla tarama sonucu oluşturulan dosyanın bilgisayar belleğinde kapladığı alan da artar. Çözünürlük seçimi, doküman türüne ve kullanım amacına göre belirlenir. Örneğin bir fotoğraf, sadece ekranda görüntülenmek için taranıyorsa çözünürlük değeri en az 72 dpi olması yeterlidir. Dergi, kitap gibi basımlarda ise fotoğraf en az 300 dpi çözünürlükte taranmalıdır. Çözünürlük arttıkça tarama süresi ve oluşan dosya boyutunun artacağını dikkate almak gerekir.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Çözünürlük ve Dosya Boyutu İlişkisi",
        "Chunk_ID":3274
    },
    {
        "ID":79,
        "Soru":"Çekilen fotoğrafın kalitesini doğrudan etkileyen asıl faktör çözünürlük müdür?",
        "İdeal Cevap (GT)":"Çözünürlük, birim alanda kaç piksel olduğunu gösteren değer olup çekilen fotoğrafın kalitesini doğrudan etkilemektedir. Ancak çözünürlüğün yüksek olması kalitenin yüksek olması anlamına gelmez ve kaliteyi asıl etkileyen kısım algılayıcı yüzeyin büyüklüğüdür.",
        "Bağlam (Context)":"4.4.2.1.1. Çözünürlük Birim alanda kaç piksel olduğunu gösteren bu değer, çekilen fotoğrafın kalitesini doğrudan etkilemektedir. Çözünürlüğün yüksek olması, kalitenin yüksek olması anlamına gelmez ancak kaliteyi etkileyen önemli faktörlerden biri olduğu bilinmektedir. Kaliteyi asıl etkileyen kısım algılayıcı yüzeyin büyüklüğüdür.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"Çözünürlük ve Fotoğraf Kalitesi",
        "Chunk_ID":3286
    },
    {
        "ID":80,
        "Soru":"Bilgisayarda mevcut bir işletim sistemi düzgün çalışmıyorsa ne yapılmalıdır?",
        "İdeal Cevap (GT)":"Eğer bilgisayarda hâlihazırda yüklü bir işletim sistemi varsa ve düzgün çalışmadığı düşünülüyorsa sol alt köşede yer alan “Bilgisayarınızı onarın” seçeneğine tıklanabilir. Problem olan kısım tamir edildikten sonra yüklü olan işletim sistemi kullanılmaya devam edilebilir.",
        "Bağlam (Context)":"Karşılaşılacak ilk ekran görüntüsü ayarlar penceresidir. Buradan dil, saat ve klavye ile ilgili ayarlar yapılıp ileri seçeneğine tıklanarak bir sonraki adıma geçilir (). 5.6 : İşletim sistemi yükleme öncesine ait dil, bölge ve klavye türü seçim ekranı : Önyükleme işlemi CD veya DVD’den başlatma uyarısı Dış Donanım Birimleri İşletim Sistemleri ve Kurulum 156 Eğer bilgisayarda hâlihazırda yüklü bir işletim sistemi varsa ve düzgün çalışmadığı düşünülüyorsa sol alt köşede yer alan “Bilgisayarınızı onarın” seçeneğine tıklanabilir. Problem olan kısım tamir edildikten sonra yüklü olan işletim sistemi kullanılmaya devam edilebilir. Yeni bir kurulum gerçekleştirilecekse “Şimdi yükle” seçeneği tıklanarak devam edilmelidir (). : İşletim sistemini yüklemeye başlangıç ekranı Bilgisayarınıza yeni bir işletim sistemi kurmak için aşağıdaki uygulama adımlarını izleyiniz. İşletim sisteminizin kurulumu tamamlanınca öğretmeninize gösteriniz.",
        "Bloom Seviyesi":"Understanding \/ Applying",
        "Konu":"İşletim Sistemi Kurulum Aşamaları",
        "Chunk_ID":3363
    },
    {
        "ID":81,
        "Soru":"OSI ve TCP\/IP modellerinin yapısal amaçları ve uygulama alanları arasındaki temel farklılıkları analiz ederek, fiziksel katmanın veri iletim mekanizmasını bu bağlamda değerlendiriniz.",
        "İdeal Cevap (GT)":"OSI modeli iletişim standartlarını belirlemeye yönelik teorik bir çerçeve sunarken, TCP\/IP modeli farklı teknolojilere sahip ağları bağımsız olarak yönetmek için daha uygulanabilir bir yapıya sahiptir. TCP\/IP protokol kümesi, internet gibi uygulamaya yönelik ortamlarda yönetim ve geliştirme kolaylığı sağlayan çok sayıda protokol ve yardımcı programdan oluşur. Bu modellerin fiziksel katmanındaki veri iletimi, ağ kablosu ile kurulan iletişimde koaksiyel, UTP ya da fiber optik kablo üzerinden sayısal olarak gerçekleştirilir. İletim ortamındaki sinyal iletimini kontrol eden bu katman, verileri bit olarak iletir ve donanımsal altyapının yönetimini üstlenir. Sonuç olarak OSI standart belirleme işlevi görürken, TCP\/IP pratikteki ağ yönetimi ve fiziksel sinyal iletişimi için baskın modeldir.",
        "Bağlam (Context)":"Verileri bit olarak iletir. Bu katmanda ağ kablosu (medya) ile iletişim kurulur. İletim ortamındaki sinyal iletimini kontrol eder. Fiziksel katmanda veri iletimi; koaksiyel, UTP ya da fiber optik kablo üzerinden sayısal olarak gerçekleştirilir. 7.2.3. TCP \/ IP Modeli TCP \/ IP çok sayıda protokol ve yardımcı programlardan oluşan bir protokol kümesidir. TCP \/ IP başta internet olmak üzere farklı teknolojilere sahip ağları bağımsız olarak yönetir ve geliştirir. OSI modeli, iletişim standartlarını belirlemeye yöneliktir. TCP \/ IP ise daha uygulanabilir bir model olduğu için daha çok uygulamaya yöneliktir.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Ağ Modelleri ve Fiziksel Katman",
        "Chunk_ID":3534
    },
    {
        "ID":82,
        "Soru":"1980 öncesindeki üreticiye özel ağ yapıları ile ilk standart modelin getirdiği fiziksel veri sinyalleri tanımlamasının, sistemler arası iletişim sorunlarına etkisini analiz ediniz.",
        "İdeal Cevap (GT)":"1980 öncesinde üreticilerin kendi veri iletim yapılarına uygun ağ kartları üretmesi sonucunda, sistemler kendi içinde sağlıklı çalışırken diğer üreticilerin sistemleri ile tamamen uyumsuz hale gelmiştir. Bu dönemde diğer sistemlerle kurulan veri iletişimi ya çok zorlukla sağlanabilmiş ya da hiç kurulamayarak ciddi bir bağlantı sorunu yaratmıştır. Artan ağ aygıtı talebinin zorunlu kıldığı bu durum, 1980 yılında ilk standart modelin oluşturulmasına neden olmuştur. Bu standart model ile ağ aygıtları arasında fiziksel veri sinyallerinin özellikleri tanımlanarak, farklı üreticilerin sistemleri arasındaki veri iletişiminin kurumsal bir temele oturması sağlanmıştır.",
        "Bağlam (Context)":"Her üretici kendi veri iletim yapısına uygun ağ kartı üretmekteydi. Üreticiler, sistem hâline getirdikleri ürünleri müşterilere sunuyordu. Her üreticinin sistemi kendi içinde sağlıklı çalışmasına karşın diğer üreticilerin sistemleri ile uyumsuzdu. Diğer sistemlerle veri iletişimi ya çok zor kuruluyor ya da kurulamıyordu. Artan ağ aygıtı talebinin oluşturduğu zorunluluğun da etkisiyle 1980 yılında ilk standart model oluşturulmuştur. Bu model ile ağ aygıtları arasında fiziksel veri sinyallerinin özellikleri tanımlanmıştır.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Ağ Standartlarının Oluşumu",
        "Chunk_ID":3520
    },
    {
        "ID":83,
        "Soru":"Bilgisayar güvenliği sağlanırken genel güvenlik protokolleri ile kapalı kaynak sistemlerde yerleşik olarak gelen güvenlik merkezi yazılımlarının fonksiyonel kapsamlarını analiz ediniz.",
        "İdeal Cevap (GT)":"Bilgisayar virüsleri ve kötü amaçlı yazılımlara karşı genel güvenlik protokolleri, sistemin güncellenmesinin yanı sıra güvenlik duvarı kullanımı, virüs yazılımı kurulumu ve şifreli ağ kullanımı gibi bireysel önlemlerin alınmasını gerektirir. Buna ek olarak kullanıcılar, internet tarayıcı \"pop-up\" ayarlarını kapatmak, kullanıcı hesap şifrelerini belli aralıklarla değiştirmek ve veri kaybına karşı sistem geri yükleme noktası oluşturmak suretiyle manuel bir güvenlik süreci yürütmektedir. Kapalı kaynak işletim sistemleri ise bu tehditlere karşı virüs koruması, aile koruması, güvenlik duvarı ayarları, cihaz performansı ve sağlık raporları gibi araçlara erişim sağlayan güvenlik merkezi yazılımlarını yerleşik olarak sunmaktadır. Genel önlemlerde çalışma dosyalarının belirli periyotlarda yedeklenmesi zorunluyken, güvenlik merkezi yazılımları cihazın performansını ve sağlık durumunu izleyerek daha bütünleşik bir koruma sağlamaktadır. Sonuç olarak, genel protokoller çok yönlü bir kullanıcı dikkatini zorunlu kılarken, kapalı kaynak sistemlerin merkezi yazılımları bu araçları tek bir çatı altında toplayarak sistem sağlığını ve güvenliğini otomatize bir şekilde yönetmektedir.",
        "Bağlam (Context)":"Yaptığınız işlem sonucunu öğretmeninize gösteriniz. 6.1.4. Güvenlik Ayarları Bilgisayar virüsleri ve kötü amaçlı yazılımlar, bilgisayarlara zarar vermek veya kişisel bilgileri almak amacıyla özel olarak yazılmış yazılımlardır. İşletim sistemini zararlı yazılımlardan korumak için öncelikle sistem güncelleştirmeleri aktifleştirilmeli ve -varsa- işletim sistemine ait güvenlik yazılımı etkinleştirilmelidir. Bunların dışında güvenlik amacıyla şu hususlara dikkat edilmelidir: • Güvenlik duvarı yazılımları kullanılmalıdır. • Etkinliği kanıtlanmış, bilgisayarı yormadan çalışacak bir virüs yazılımı kurulmalıdır. • İnternet tarayıcı “pop-up” ayarları kapatılmalıdır. • Kullanıcı hesaplarının (özellikle yönetici) şifreleri belli aralıklarla değiştirilmelidir. • İnternet erişiminde şifresiz Wi-Fi bağlantıları kullanılmamalıdır. • Sistem geri yükleme noktası oluşturularak sorun hâlinde sistemin güvenli bir noktaya dönüşü sağlanmalıdır. • Çalışma dosyaları belirli periyotlarda yedeklenmelidir. 6.1.4.1. Kapalı Kaynak Sisteminde Güvenlik Ayarları Günümüzün kapalı kaynak işletim sistemleri, antivirüs ve kötü amaçlı yazılımlara karşı güvenlik merkezi yazılımlarıyla birlikte gelir. Güvenlik merkezi yazılımları; virüs koruması, aile koruması, güvenlik duvarı ayarları, cihaz performansı ve sağlık raporları gibi güvenlikle ilgili araçlara erişim sağlayan yazılımlardır.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Bilgisayar Güvenliği ve Koruması",
        "Chunk_ID":3467
    },
    {
        "ID":84,
        "Soru":"CCD tabanlı görüntü işleme sürecinde ışığın optik yoldaki dönüşümünü ve mekanik hareketin işlevini analiz ederek sistemin çalışma prensibini açıklayınız.",
        "İdeal Cevap (GT)":"CCD tabanlı tarama sisteminde süreç, ışık kaynağından dokümana tutulan ışığın yansıması ile başlar ve bu yansıyan ışık aynalar aracılığıyla lens üzerine aktarılır. Lens tarafından odaklanan ışık CCD algılayıcı üzerinde analog bir sinyale dönüştürülür ve bu sinyal analog-dijital çevirici (ADC) sayesinde dijital veriye işlenir. Optik bileşenler veriyi dönüştürürken, adım motor sistemi yatay düzlemde ileri-geri hareket ettirerek tarama işleminin fiziksel gerçekleşmesini sağlar. Sonuç olarak, ışığın optik bileşenler tarafından yönlendirilip elektrik sinyallerine çevrilmesi ile mekanik bir hareketin birleşimi, dokümanın dijital materyale dönüşümünü tamamlar.",
        "Bağlam (Context)":"Kullanılan algılayıcıya göre tarayıcı bileşenleri değişir. ’de tarayıcı bileşenleri (CCD algılayıcı) görülmektedir. CCD tarayıcı; ışık kaynağı (lamba ya da LED), ayna, lens, optik algılayıcı ve adım (step) motor bileşenlerinden oluşur. Tarama işlemi, ışık kaynağından doküman (belge) üzerine ışık tutulması ile başlar. Tutulan ışık, dokümandan yansır ve aynaların üzerine düşer. Aynalar, yansıyan ışığı lens üzerine aktarmak için kullanılır. Lens, aktarılan ışığı odaklayarak CCD algılayıcı üzerine düşürür. CCD tarafından analog sinyale çevrilen ışık, analog-dijital çevirici (ADC) ile dijital sinyallere dönüştürülerek taranan materyalin dönüşümü sağlanmış olur. Adım motor ise tarama sistemini yatay düzlemde ileri geri hareket ettirmek için kullanılır. 4.4.1.1. Tarayıcı Çeşitleri Kullanım amacı, çözünürlük değeri, tarama boyutu, ADF (otomatik belge besleyici) gibi birçok özellik, farklı türlerde tarayıcıların üretilmesini sağlamıştır.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"CCD Tarayıcı Bileşenleri ve Çalışma Prensibi",
        "Chunk_ID":3267
    },
    {
        "ID":85,
        "Soru":"Ağ yapılandırmasında bilgisayar adı ile IP adresi arasındaki ilişkinin, ping komutu çıktısı üzerinden başarılı bir şekilde çözümlenip çözümlenmediğini analiz ediniz.",
        "İdeal Cevap (GT)":"PC0 bilgisayarı üzerinden Command Prompt kullanılarak PC1 hedefine ping atıldığında, komut satırına bilgisayar adı girilmesine rağmen işlemin 192.168.1.4 IP adresi üzerinden gerçekleştirildiği görülmektedir. Bu durum, ağ üzerinde veri iletiminin doğrudan isim çözümüyle değil, 32 bitlik sayısal IP adresleri üzerinden yapıldığını göstermektedir. Ping komutunun bilgisayar adını otomatik olarak IP adresine çevirebilmesi, DNS sunucusunun yapılandırmasının doğru olduğunu ve isim çözümü hizmetinin aktif olduğunu kanıtlar. Sonuç olarak, 'deki ekran çıktısı, DNS üzerinde IP adres çevriminin başarılı bir şekilde gerçekleştiğini teyit etmektedir.",
        "Bağlam (Context)":"Bu kısımda her cihaza ait ad ve adres bilgileri yazınız ve kaydediniz. Adım 7: DNS sunucunun çalışması ping komutu ile test edilir. PC0 bilgisayarı üzerine tıklanır ve Desktop sekmesinde Command Prompt (komut istemi) seçilir. Test işlemi için komut istemi penceresine ping PC1 komutu yazılır ve klavyede enter tuşuna basılır. ’de, komut ekran çıktısı incelendiğinde ping komutunda bilgisayar adı (PC1) yazılmasına karşın işlemde 192.168.1.4 IP adresinin kullanıldığı görülmektedir. Bu durum DNS üzerinde, IP adres çevriminin başarılı bir şekilde gerçekleştiğini gösterir.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"DNS Sunucusu Test ve Yapılandırması",
        "Chunk_ID":3554
    },
    {
        "ID":86,
        "Soru":"Dijital fabrika ve dijital ikiz teknolojilerinin sistem odaklı faydalarını analiz ederek, fiziksel üretim süreçlerine etkileri açısından birbirlerinden temel farkları nelerdir?",
        "İdeal Cevap (GT)":"Dijital fabrika; araçların, malzemenin ve yazılımsal birimlerin sürekli takibi ile mesafeli müdahale imkanı sağlarken, dijital ikiz teknolojisi fiziksel yapılar ile sanal yapılar arasında kurulan köprü sayesinde problemlerin ortaya çıkmadan çözülmesine ve sistemin yeniliklere adapte olmasına imkân vermektedir. Dijital fabrika yapısında yazılım programları ile istatistiki değerlendirmeler, kâr ve zarar durumları ve operasyonel işlemler gerçekleştirilebilmekteyken, dijital ikiz teknolojisinin en büyük avantajı ekipmanların sanal ortamda oluşturulması ve test edilebilmesidir. Bu teknoloji ilk olarak NASA tarafından uzay araçlarının fiziksel olarak yakında olmayan sistemlerinin uzaktan yönetilmesi ve aksaklıklarının giderilmesi amacıyla geliştirilmiş olup, sanal modellerin oluşturulması arızaların azaltılmasını sağlamaktadır. Sonuç olarak dijital fabrika mevcut verilerle operasyonel verimlilik ve kontrol sağlarken, dijital ikiz teknolojisi simülasyonlar ve eşleme teknolojisi (pairing technology) ile arızaların önlenmesine ve sistemin proaktif yönetilmesine odaklanmaktadır.",
        "Bağlam (Context)":"2.8.2 Dijital Fabrika Dijital fabrika; üretimde randımanı arttırarak araçların, malzemenin, yazılımsal birimlerin her zaman takibinin sağlanmasını ve müdahalenin mesafeli olarak bile yapılabilmesini sağlayan IoT (nesnelerin interneti) nesnelerinin yoğun kullanıldığı fabrika türleridir. Yazılım programlarıyla fabrikaya ait tüm veriler ve fabrikada yaşananlar kaydedilmektedir. İstatistiki değerlendirmeler, kâr ve zarar durumları, operasyonel işlemler yapılabilmektedir. Dijital fabrikalarda tüm sistemin yazılımlarla kontrol edilmesinin üretim, arıza, bakım ve onarım bandında faydaları nelerdir? Sanal fabrika ve dijital fabrika ile ilgili birer örnek vererek bu tür fabrikaların sistemlerinin işleyişi hakkında bilgi veriniz. 2.8.3 Dijital İkiz Dijital ikiz; bir işlemin, ürünün ya da hizmetin bire bir sanal modelinin oluşturulmasıdır. Fiziksel yapılar ile sanal yapılar arasında kurulan köprü ile o sisteme ait verilerin toplanması, analizi, problemlerin daha meydana gelmeden çözümler üretilmesine ve böylelikle arızaların azaltılmasına ve sistemin yeniliklere kolayca adapte olmasına imkân vermektedir. Dijital ikiz fikri ilk olarak NASA’da ortaya çıkmıştır. Uzay araçlarının fiziksel olarak yakında olmayan sistemlerinin uzaktan yönetilmesi, çalıştırılması ve aksaklıklarının giderilmesi için NASA mühendisleri önce eşleme teknolojisini (pairing technology) sonraları da dijital ikiz simülasyonlarını oluşturmuşlardır. Dijital ikiz teknolojisinin en büyük avantajı, ekipmanların sanal ortamda oluşturulması ve test edilebilmesidir.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Dijital Fabrika ve IoT Kullanımı",
        "Chunk_ID":3004
    },
    {
        "ID":87,
        "Soru":"Ağ yapılandırmasında statik atama yöntemi ile DHCP sunucusu tabanlı dinamik adresleme arasındaki temel farkları; operasyonel verimlilik, adres yönetimi ve olası ağ hataları açısından analiz ediniz.",
        "İdeal Cevap (GT)":"Statik adresleme yöntemi Internet Protokol sürüm 4 (TCP\/IPv4) özellikleri penceresi üzerinden manuel giriş gerektirirken, dinamik adresleme DHCP sunucusu üzerinden IP, alt ağ maskesi, varsayılan ağ geçidi ve DNS adreslerini otomatik olarak dağıtır. Manuel yöntem çalışmada uyuma ve düzene sağladığı katkıyla zamanı verimli kullanma açısından avantajlı görünse de, dinamik yöntem işlem yükünü minimize ederek daha geniş bir operasyonel verimlilik sunar. Statik yapılandırmada insan kaynaklı hatalar neticesinde cihazların yinelenen veya geçersiz IP adresi kullanma olasılığı yüksekken, DHCP sunucusu bu olasılığı azaltarak ağ yönetimini merkezi hale getirir. Dinamik yöntemde işletim sistemlerinin ağ arabirim kartı adres özellikleri varsayılan olarak otomatik alınacak şekilde tanımlandığı için, kullanıcı müdahalesine gerek kalmadan ağa dahil olma süreci hız kazanır. Sonuç olarak, statik yöntem bireysel düzen sağlasa da, dinamik adresleme hata payını düşürmesi ve yapılandırma parametrelerini otomatik dağıtması nedeniyle ağ yönetimi açısından daha güvenilirdir.",
        "Bağlam (Context)":"Dinamik Adresleme Ağa katılan bilgisayarlara, dinamik ana bilgisayar yapılandırma protokol (DHCP) sunucusu üzerinden otomatik olarak IP adresleri dağıtılabilir. DHCP sunucu, cihazların yinelenen veya geçersiz IP adresi kullanma olasılığını azaltır. DHCP sunucusu; ağa dâhil olan cihazlara IP, alt ağ maskesi, varsayılan ağ geçidi adresleri ile DNS adreslerini dağıtabilir. İşletim sistemlerinde ağ arabirim kartı adres özellikleri otomatik olarak alınacak şekilde tanımlıdır. ’da IPv4 özellikleri penceresinde “Otomatik olarak bir IP adresi al” seçeneği varsayılan olarak ÖLÇÜTLER EVET HAYIR Internet Protokol sürüm 4 (TCP \/ IPv4) özellikleri penceresini açar. IP adreslerini pencerede bulunan alanlara statik adresleme yöntemiyle girer. Çalışmada uyuma ve düzene önem verir. Zamanı verimli ve iyi kullanır. 7.12 Dış Donanım Birimleri Ağ Temelleri 243 tanımlanmıştır.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Dinamik IP Adresi Dağıtımı (DHCP)",
        "Chunk_ID":3636
    },
    {
        "ID":88,
        "Soru":"Ethernet kartı montajında gerçekleştirilen fiziksel kurulum adımları ile sistem içi yazılımsal doğrulama komutları arasındaki işlevsel ilişkiyi analiz ediniz.",
        "İdeal Cevap (GT)":"Fiziksel kurulum süreci, kartın anakart üzerindeki genişleme yuvasına yerleştirilmesi, vida ile sabitlenmesi ve ağ kablosu takılarak kasaya kapatılması eylemlerini kapsarken, yazılımsal süreç bu donanımın işletim sistemi tarafından tanınmasını ve ağ protokollerine entegrasyonunu hedefler. İşletim sistemi seviyesinde sürücü dosyalarının yüklenmesi kartın donanımsal hazırlığını tamamlarken, komut istemi üzerinden çalıştırılan 'getmac' komutu kartın kimlik bilgilerini, 'ipconfig -all' komutu ise otomatik adres atamasını doğrulamak için kullanılır. Bu doğrulama adımları, montajın sadece mekanik bir birleşim değil, aynı zamanda ağ iletişimi için gerekli adreslemenin (MAC ve IP) başarıyla yapıldığını gösteren kritik kontrol noktalarıdır. Sonuç olarak, vida ile sağlanan fiziksel bağlantının stabilitesi, yazılımsal komutlarla görüntülenen adres bilgilerinin doğruluğu ile birleşerek ağ bağlantısının tam ve sorunsuz kurulmasını sağlar.",
        "Bağlam (Context)":"Adım 4: Kartın kasayla birleşim yerini bir vida ile sıkıştırır. Adım 5: Kasa kapağını kapatır. Adım 6: Bilgisayarı güç düğmesine basarak çalıştırır. Adım 7: Ethernet kartını işletim sistemine tanıtır (Kart sürücü dosyalarını yükler.). Adım 8: Komut isteminde getmac komutunu kullanır, kartın MAC adres bilgilerini görüntüler. Adım 9: Ethernet kartının girişine ağ kablosunu takar ve bilgisayarı ağa bağlar. Adım 10:Komut isteminde ipconfig -all komutunu kullanır, kartın otomatik adres bilgilerini görüntüler. Anakart üzerine Ethernet kartı montajını, uygulama adımlarına dikkat ederek gerçekleştiriniz. Montaj işlem adımlarını yazınız. Gereksinimlerimiz: Anakart, Ethernet kartı, işletim sistemi Adım 1: Adım 2: Adım 3: : Ethernet kartının genişleme yuvasına montajı : Kart montajının kontrolü 7.6 Dış Donanım Birimleri Ağ Temelleri 245 Adım 4: Adım 5: Adım 6: Adım 7: Adım 8: Adım 9: Adım 10: Değerlendirme Anakart üzerine Ethernet kartı montajı faaliyeti, aşağıdaki listede yer alan ölçütlere göre değerlendirilecektir. Çalışmanızı yaparken bu ölçütleri dikkate alınız. ÖLÇÜTLER EVET HAYIR Bilgisayar kasasını açar. Anakarta zarar vermeden kartı düzgün bir şekilde yerleştirir. Kartın kasayla birleşim yerini bir vida ile sıkıştırır. Kasa kapağını kapatır. Bilgisayarı çalıştırır. Ethernet kartını işletim sistemine tanıtır. Kartın MAC adres bilgilerini görüntüler (getmac komutu). Ağ kablosunu karta takar ve bilgisayarı ağa bağlar. Kartın otomatik adres bilgilerini görüntüler (ipconfig komutu).",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Ethernet Kartı Kurulumu",
        "Chunk_ID":3642
    },
    {
        "ID":89,
        "Soru":"Kapalı kaynak işletim sistemlerindeki yönetici ve standart kullanıcı hesaplarının yetki sınırlarını, güvenlik ayarları ve sistem bütünlüğü üzerindeki etkileri açısından analiz ediniz.",
        "İdeal Cevap (GT)":"Yönetici hesabı bilgisayarı kimlerin kullanacağına karar vererek tüm bilgisayarı kontrol ederken, güvenlik ayarlarını değiştirebilir, yazılım yükleyebilir ve diğer kullanıcı hesaplarında değişiklik yapabilir. Buna karşın standart hesap sahipleri işletim sistemi kullanımı ile ilgili birçok işlemi yapabilirler ancak bilgisayarda büyük değişiklikler yapamazlar. Yönetici hesabına sahip kullanıcılar bilgisayardaki tüm dosyalara erişebilirken, diğer kullanıcıları etkileyecek değişiklikler yapabilen tek hesap türü yönetici hesabıdır. Dolayısıyla yönetici hesabı sistem üzerinde sınırsız bir hakimiyet kurarken, standart hesaplar güvenlik ve sistem bütünlüğünü korumak adına kısıtlı bir kullanım alanına sahiptir.",
        "Bağlam (Context)":"6.1.1.1. Kapalı Kaynak Sisteminde Kullanıcı Hesapları Kapalı kaynak işletim sistemi kurulumunda varsayılan olarak bir kullanıcı hesabı oluşturulur. Bu hesap yönetici hesabıdır. Yönetici hesabı oluşturulduktan sonra aile üyeleriyle veya arkadaşlarla bilgisayarı güvenli bir şekilde paylaşmak için farklı izin düzeylerine ait hesaplar oluşturulabilir ve bu hesaplar yönetici tarafından denetlenebilir. Kapalı kaynak işletim sisteminde yönetici, standart, çocuk ve misafir olmak üzere dört temel kullanıcı hesabı vardır. Yönetici: Bilgisayarı kimlerin kullanacağına ve her kullanıcının ne yapabileceğine karar vererek tüm bilgisayarı kontrol eder. Bilgisayarda diğer kullanıcıları etkileyecek değişiklikler yapabilen hesaptır. Yönetici hesabına sahip kullanıcılar işletim sisteminde güvenlik ayarlarını değiştirebilirler. Aynı zamanda bu kullanıcılar yazılım yükleyebilir, bilgisayardaki tüm dosyalara erişebilir ve diğer kullanıcı hesaplarında değişiklik yapabilirler. Standart: Standart hesap sahipleri işletim sistemi kullanımı ile ilgili birçok işlemi yapabilirler ancak bilgisayarda büyük değişiklikler yapamazlar. Dış Donanım Birimleri İşletim Sistemleri Temel Kullanım 185 Çocuk: Çocuk hesabı, aile koruması ayarlarının otomatik olarak açıldığı standart bir hesaptır. Çocuk hesabı sayesinde çocukların yaşlarına uygun olmayan içeriklere (uygulamalar, oyunlar ve web siteleri gibi) erişimleri kısıtlanabilmektedir.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Kapalı Kaynak Sisteminde Kullanıcı Hesapları",
        "Chunk_ID":3440
    },
    {
        "ID":90,
        "Soru":"Kapalı kaynak işletim sistemindeki yönetici ve standart kullanıcı hesaplarının sistem güvenliği ve değişiklik yapma yetkileri açısından temel farklarını analiz ediniz.",
        "İdeal Cevap (GT)":"Yönetici hesabı bilgisayarda kimlerin kullanacağına karar vererek tüm bilgisayarı kontrol ederken, standart hesap sahipleri işletim sistemi kullanımı ile ilgili birçok işlemi yapabilirler ancak bilgisayarda büyük değişiklikler yapamazlar. Yönetici hesabına sahip kullanıcılar güvenlik ayarlarını değiştirebilir, yazılım yükleyebilir, bilgisayardaki tüm dosyalara erişebilir ve diğer kullanıcı hesaplarında değişiklik yapabilirler; buna karşın standart hesaplar bu düzeyde yetkiye sahip değildir. Yönetici hesabı bilgisayarda diğer kullanıcıları etkileyecek değişiklikler yapabilen tek hesap türü iken, standart hesaplar sistem bütünlüğünü tehlikeye atacak müdahalelerden kısıtlanmıştır. Çocuk hesabı aile koruması ayarlarının otomatik olarak açıldığı standart bir hesap olmakla birlikte, yönetici tarafından yaşlarına uygun olmayan içeriklere erişimleri kısıtlanabilmektedir. Sonuç olarak sistem yönetimi ve denetimi tamamen yöneticide toplanmış olup, diğer hesaplar yönetici tarafından belirlenen sınırlar dâhilinde güvenli bir şekilde kullanılmaktadır.",
        "Bağlam (Context)":"6.1.1.1. Kapalı Kaynak Sisteminde Kullanıcı Hesapları Kapalı kaynak işletim sistemi kurulumunda varsayılan olarak bir kullanıcı hesabı oluşturulur. Bu hesap yönetici hesabıdır. Yönetici hesabı oluşturulduktan sonra aile üyeleriyle veya arkadaşlarla bilgisayarı güvenli bir şekilde paylaşmak için farklı izin düzeylerine ait hesaplar oluşturulabilir ve bu hesaplar yönetici tarafından denetlenebilir. Kapalı kaynak işletim sisteminde yönetici, standart, çocuk ve misafir olmak üzere dört temel kullanıcı hesabı vardır. Yönetici: Bilgisayarı kimlerin kullanacağına ve her kullanıcının ne yapabileceğine karar vererek tüm bilgisayarı kontrol eder. Bilgisayarda diğer kullanıcıları etkileyecek değişiklikler yapabilen hesaptır. Yönetici hesabına sahip kullanıcılar işletim sisteminde güvenlik ayarlarını değiştirebilirler. Aynı zamanda bu kullanıcılar yazılım yükleyebilir, bilgisayardaki tüm dosyalara erişebilir ve diğer kullanıcı hesaplarında değişiklik yapabilirler. Standart: Standart hesap sahipleri işletim sistemi kullanımı ile ilgili birçok işlemi yapabilirler ancak bilgisayarda büyük değişiklikler yapamazlar. Dış Donanım Birimleri İşletim Sistemleri Temel Kullanım 185 Çocuk: Çocuk hesabı, aile koruması ayarlarının otomatik olarak açıldığı standart bir hesaptır. Çocuk hesabı sayesinde çocukların yaşlarına uygun olmayan içeriklere (uygulamalar, oyunlar ve web siteleri gibi) erişimleri kısıtlanabilmektedir.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Kapalı Kaynak Sisteminde Kullanıcı Hesapları",
        "Chunk_ID":3440
    },
    {
        "ID":91,
        "Soru":"Optik ve lazer farelerin ışık kaynağı ve algılama mekanizması bakımından çalışma prensiplerini karşılaştırarak, hangi teknolojinin yüzey takibi için daha avantajlı olabileceğini analiz ediniz.",
        "İdeal Cevap (GT)":"Optik fareler ışık kaynağı olarak kırmızı, mavi veya kızılötesi LED kullanırken, lazer farelerde kızılötesi lazer teknolojisi tercih edilmektedir. Her iki fare türü de hareket yüzeyinden yansıyan ışık demetlerini işleyerek imleç hareketini gerçekleştirmektedir. Optik fareler düşük çözünürlüklü bir dijital kamera gibi yüzeyin ardışık görüntülerini çekerken, lazer fareler daha hassas bir ışık kaynağı sayesinde yüzey detaylarını daha net algılayabilmektedir. Çalışma prensibi gereği farenin alt yüzeyindeki ışık rengi optiklerde görülebilirken, kızılötesi lazerde gözle görülmemektedir. Bu teknik farklılık lazer farelerin daha hassas yüzey takibi yapmasına olanak tanırken, optik farelerin standart yüzeylerde daha yaygın kullanımına imkan vermektedir.",
        "Bağlam (Context)":"Her ikisinde de verici olarak ışık kaynağı kullanılır. Hareket yüzeyinden yansıyan ışık hareketlerini işleyerek imleç hareketini gerçekleştirir. Optik farelerde ışık kaynağı olarak LED kullanılırken lazer farelerde kızılötesi lazer kullanılır. Optik farelerde ışık kaynağı olarak kırmızı, mavi veya kızılötesi LED kullanılmaktadır. Farelerin alt yüzeyine bakıldığında LED ışığının rengi görülür (kızılötesi hariç). ’da optik fare iç yapısında bulunan ışık kaynağı (LED veya lazer), ayna, lens, algılayıcı (tipik olarak bir CMOS sensörü) ve dijital sinyal işlemcisi (DSP, mikro işlemci) görülmektedir. : Kablolu klavye arabirimleri : Klavye adaptörleri : Oyun faresi : Optik fare iç yapısı 103 Dış Donanım Birimleri Optik farelerin çalışma sistemi, yüzeyin ardışık görüntülerini çeken düşük çözünürlüklü dijital (sayısal) kameraya benzer. Fare ışık kaynağında (LED veya lazer) ışık demeti oluşturulur. Işık demeti, yansıtıcı aynalar üzerinden geçer ve farenin hareket yüzeyine yansır.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Optik ve Lazer Farelerin Çalışma Prensibi",
        "Chunk_ID":3170
    },
    {
        "ID":92,
        "Soru":"İyonize gaz akımıyla oluşan UV fotonlarının fosfor tabakaya çarpması sonucu meydana gelen enerji dönüşümünü, görüntü kalitesi üzerindeki etkileri bağlamında analiz ediniz.",
        "İdeal Cevap (GT)":"Elektrotlar üzerinden hücreye giren akım, iyonize gaz üzerinde yüksek hızlı yüklü parçacık hareketi yaratarak UV fotonlarının oluşmasını sağlar. Bu UV fotonları fosfor tabakaya çarptığında fosfor atomları yüksek enerji ile yüklenir ve bu durum atomların ısınmasına neden olur. Yüksek enerjiye ulaşan atomlar, sahip oldukları bu enerjiyi ışık fotonu şeklinde ortaya yayarlar. Görüntü parçacıklarının aynı anda doğrudan yansıması sayesinde, bu süreç sonucunda detay kaybı veya keskinlik sorunu oluşmaz.",
        "Bağlam (Context)":"Elektrotların farklı gerilimle şarj edilmeleriyle hücre içerisine iyonize edilmiş gaz üzerinden akım girişi olur. Bu akım, UV fotonlarının oluşmasına neden olan yüksek hıza sahip yüklü parçacık hareketine neden olur. UV fotonları, fosfor tabakaya çarparak fosfor atomlarını yüksek enerji ile yükler. Bu enerji, atomların ısınmasına neden olur. Sonrasında ise atomlar, sahip olduğu enerjiyi ışık fotonu şeklinde ortama yayar. Görüntü parçacıkları aynı anda doğrudan yansıdığı için detay kaybı veya keskinlik oluşmaz.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Plazma Ekran Teknolojisi Çalışma Prensibi",
        "Chunk_ID":3203
    },
    {
        "ID":93,
        "Soru":"Temel araştırma, uygulamalı araştırma ve deneysel geliştirme süreçlerinin amaç ve özellikleri bakımından temel farklarını analiz ediniz.",
        "İdeal Cevap (GT)":"Temel araştırma gözlemlenebilir olayların temellerine ait yeni sonuçlar elde etmek için deneysel ve teorik çalışmalar yaparken, uygulamalı araştırma yeni bir kazanıma ulaşmak ve yeni bir bilgi edinmek için belirli aşamaları olan özgün araştırmaları kapsar. Buna karşın deneysel geliştirme süreci, mevcut kazanımlardan faydalanılarak yeni ürün, cihaz veya sistemlerin üretilmesine veya var olanların geliştirilmesine yönelik çalışmaları ifade eder. Bu üç süreç AR-GE projesi kapsamında değerlendirildiğinde; alışılmışın dışında olma, yaratıcılık, belirsizlik, sistematik yapı ve aktarılabilirlik gibi ortak kriterlere sahip olmaları gerekmektedir. Temel araştırma teorik altyapıyı oluştururken, uygulamalı araştırma bu bilgiyi somut kazanıma dönüştürür ve deneysel geliştirme ise elde edilen kazanımları ticari veya teknik ürünlere işler. Dolayısıyla bu üç tür, bilgi üretiminden somut ürün çıktısına kadar giden inovasyon sürecinin ardışık basamaklarını temsil eder.",
        "Bağlam (Context)":"Yeni bilgiler elde etmek ve bu bilgilerin gerekli yerlerde kullanılmasını sağlamak için yapılır. Projeler; benzerlerinden farklı olarak bir ürün hedefi ve hedefe ulaşmak için belli aşamaları, proje adımları olan ve kaynak kullanımı gerektiren faaliyetlerin tamamıdır. Projenin benzer değil özgün olması, bir konuda farklılık oluşturması gerekmektedir. AR-GE projeleri 3 grupta toplanabilir: • Temel Araştırma: Gözlemlenebilir olayların temellerine ait yeni sonuçlar elde etmek için yapılan deneysel ve teorik çalışmalardır. Örnek: lazer ışınları • Uygulamalı Araştırma: Yeni bir kazanıma ulaşmak ve yeni bir bilgi edinmek için belirli aşamaları olan özgün araştırmadır. Uygulama araştırmasına örnek olarak ’dakine benzer bir poster örneği oluşturunuz. • Deneysel Geliştirme: Mevcut kazanımlardan faydalanılarak yeni ürün, cihaz, malzeme, sistem ve modellerin üretilmesine veya var olanların geliştirilmesine yönelik çalışmalardır. 2.46 2.47 : Bilimsel yazılım projesi örneği 53 Dijital Dönüşüm AR-GE projesi kriterleri şunlardır: 1. Alışılmışın Dışında (Orijinal): Yeni buluşlara odaklanmalıdır. 2. Yaratıcı: Orijinal olan, bilinir olmayan kavram ve hipotezler üzerinde temellendirilmelidir. 3. Belirsiz (Kesinleşmemiş): Son çıktı konusun­ da belirsizlikler olmalıdır. 4. Sistematik: Planlanmış olmalı ve bütçelendirilmelidir. 5. Aktarılabilir ve Tekrar Edilebilir: Yeniden üretilebilen sonuçlara yönelmelidir. Bir AR-GE projesinin yaşam döngüsü (yönetim aşamaları)",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Proje Tanımı ve AR-GE Türleri",
        "Chunk_ID":3038
    },
    {
        "ID":94,
        "Soru":"Giriş sinyalinin çözünürlüğü ile projektörün doğal piksel kapasitesi arasındaki uyumsuzluk durumunda, görüntü kalitesine etkisi olan teknik işlemleri ve donanımsal bileşenleri analiz ediniz.",
        "İdeal Cevap (GT)":"Giriş sinyalleri projektörün gösterebileceğinden farklı çözünürlüklerde geldiğinde, cihaz bu verileri sıkıştırma veya genişletme işlemine tabi tutarak kendi maksimum çözünürlük değerinde yansıtır. Projektörler gerçek piksel adedinden fazla piksel görüntüleyemedikleri için, bu uyumsuzluk sonucu görüntüde bulanıklık meydana gelebilir. Görüntünün yansıtılması sürecinde, projeksiyonun yansıtma teknolojisine göre farklılık gösteren ve ünite ile ampulünden meydana gelen ışık kaynağı olan lamba devreye girer. Sinyallerin sıkıştırılarak en yüksek çözünürlük değerine zorlanması, donanımsal ışık kaynağının özellikleriyle birleşerek son görüntü niteliğini belirler.",
        "Bağlam (Context)":"Projektör, gerçek piksel adedinden fazla piksel görüntüleyemez. Maksimum çözünürlük, projektörün sıkıştırabileceği en yüksek çözünürlük değeridir. Bilgisayar ve video kaynağından görüntü sinyalleri projeksiyon cihazının gösterebileceğinden farklı çözünürlüklerde gelse de projektörler, bu sinyalleri sıkıştırma veya genişletme işlemine tabi tutarak gösterebilecekleri en yüksek çözünürlük değerinde yansıtır. Bu işlemler sonucu görüntüde bulanıklık olabilir. 4.2.2.1.2. Lamba Ömrü Projektör lambası, ekrana görüntünün yansımasını sağlayan bir ışık kaynağıdır. Projeksiyon lambaları, projeksiyonun yansıtma teknolojisine göre farklılık gösterir. Projeksiyon lambası, projektör ünitesi ve ampulünden meydana gelir.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Projektör Çözünürlük ve Lamba Ömrü",
        "Chunk_ID":3217
    },
    {
        "ID":95,
        "Soru":"Sabit disk sürücülerinin veri okuma\/yazma performansını doğrudan etkileyen mekanik ve mantıksal yapısal özellikleri analiz ederek, bu özelliklerin performans üzerindeki etkilerini değerlendiriniz.",
        "İdeal Cevap (GT)":"Sabit disk sürücülerin merkezindeki motorun dakikadaki dönüş sayısı arttıkça, manyetik plakaların RPM değeri yükselerek sürücünün veri işleme performansı doğrudan artmaktadır. Depolama kapasitesini belirleyen iz sayısı disk üzerindeki halkaların yoğunluğu ile doğru orantılıyken, fiziksel veri transferinin en küçük birimi olan sektörler mantıksal veri bloğunu oluşturmaktadır. İşletim sisteminin belirlediği sayıdaki sektörlerin bir araya gelmesiyle oluşan kümeler (cluster), veri okuma ve yazma işlemlerinin her seferinde gerçekleştirildiği ana birimlerdir. Sonuç olarak sürücünün mekanik hızını belirleyen yüksek RPM değeri ile verinin mantıksal organizasyonunu sağlayan küme yapısı, sabit diskin toplam veri erişim ve işleme hızını birlikte tanımlamaktadır.",
        "Bağlam (Context)":"’te manyetik diskli bir sabit sürücü iç yapısı gösterilmiştir. SATA hard disklerin merkezinde bulunan motorun dönüşü, sabit diskin performansını doğrudan etkiler. Bu motorun dakikadaki dönüş sayısı 5.400, 7.200, 10.000 ve 15.000 ile ifade edilmektedir. Manyetik plakaların dakikadaki dönüş sayısı RPM (rotate per minute) ile ifade edilir. RPM değeri ne kadar yüksek ise sabit disk sürücünün performansı o kadar yüksektir, denilebilir. SATA hard disk sürücülerinin plakaları, depolama alanı için kullanılmaktadır. Verileri depolamak için tam bir tur atan iç içe daire şeklindeki halkalardan oluşan bir yapı bulunmaktadır. Buna iz (track) adı verilir. İzlerin sayısı, disk sürücüsünün kapasitesi ile doğru orantılıdır. ‘te manyetik plaka üzerinde oluşturulan iz, sektör ve kümeye ait görsel verilmiştir. Her track, sektör adı verilen küçük bölümlere ayrılmıştır. Sektör, diskteki en küçük fiziksel depolama birimidir. Sektörlerin bir araya gelmesi ile “küme (cluster)” oluşmaktadır. Cluster, işletim sisteminin kendisinin belirlediği bir sayıdaki, her defasında birlikte okunan ya da yazılan sektörler kümesidir. Genel olarak veri depolama birimi Gigabayt’tır (GB). Piyasada farklı kapasitede ve dönüş hızında SATA sabit diskler bulunmaktadır.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Sabit Disk Yapısı ve Performansı",
        "Chunk_ID":3122
    },
    {
        "ID":96,
        "Soru":"Hava soğutma ve sıvı soğutma sistemlerinin etkinlik, maliyet ve gürültü seviyeleri açısından farklılıklarını analiz ederek, ısı borulu sistemin çalışma prensibini bu karşılaştırma bağlamında değerlendiriniz.",
        "İdeal Cevap (GT)":"Sıvı ile soğutma sistemi, hava ile soğutma sistemine göre daha pahalı olmasına rağmen daha etkin ve daha az gürültülü çalışma özelliğine sahiptir. Sıvı soğutmada işlemci ısısı sıvıya aktarılarak radyatör ve fan düzeneğiyle azaltılırken, ısı borulu teknikte işlemci ısısı soğutucu aracılığıyla özel bir sıvıya aktarılmaktadır. Isıl borulu sistemdeki bu özel sıvı, çok çabuk buharlaşabilen ve yoğunlaşabilen bir yapıya sahiptir. Bu karşılaştırma, sıvı ve ısı borulu sistemlerin ısı transferi için akışkan faz değişimleri veya aktarım mekanizmaları kullanarak hava soğutmasına göre termal avantaj sağladığını göstermektedir. Sonuç olarak maliyet artışı, daha yüksek soğutma verimi ve sessiz çalışma performansı ile dengelenmektedir.",
        "Bağlam (Context)":"Bu soğutma tekniğinde işlemci üzerindeki ısı, sıvıya aktarılmaktadır. Isınan sıvının ısısı, radyatör ve yine fan düzeneği yardımıyla azaltılmaktadır. Hava ile soğutma sistemine göre daha pahalı olmasına karşılık, sıvı ile soğutma sistemi daha etkilidir. Ayrıca daha az gürültülü çalışır. ’de sıvı ile soğutma sistemi uygulanmış bir bilgisayar kasası gösterilmiştir. 3.2.4.3. Isıl Borulu Soğutma Isıl borulu soğutma tekniğinde işlemcinin ısısı, soğutucu aracılığıyla içerisinde özel bir sıvı olan ısı borularına aktarılır. Bu özel sıvı, çok çabuk buharlaşabilen ve yoğunlaşabilen bir sıvıdır.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Sıvı ile Soğutma Sistemi",
        "Chunk_ID":3083
    },
    {
        "ID":97,
        "Soru":"Isıl borulu soğutma ile sıvı soğutma sistemlerinin ısı transferi mekanizması ve çalışma prensipleri açısından temel farklarını analiz ediniz.",
        "İdeal Cevap (GT)":"Isıl borulu soğutma tekniğinde işlemcinin ısısı doğrudan soğutucu aracılığıyla içinde özel bir sıvı bulunan borulara aktarılırken, bu sistemdeki özel sıvı çok çabuk buharlaşabilme ve yoğunlaşabilme özelliğine sahiptir. Buna karşın sıvı ile soğutma sisteminde ısı işlemci üzerinden bir sıvıya aktarılarak, ısınan sıvının ısısı radyatör ve fan düzeneği yardımıyla azaltılmaktadır. Hava ile soğutma sistemine göre daha pahalı ve daha etkili olan sıvı soğutma, aynı zamanda daha az gürültülü çalışma avantajına da sahiptir. Her iki sistem de ısıyı işlemciden uzaklaştırmak için sıvı kullanımına dayanmasına rağmen, ısıl borulu sistemde faz değişimi (buharlaşma ve yoğunlaşma) prensibi devreye girerken, standart sıvı soğutmada ısının taşınması ve radyatörle dağıtılması süreci gerçekleşmektedir.",
        "Bağlam (Context)":"Bu soğutma tekniğinde işlemci üzerindeki ısı, sıvıya aktarılmaktadır. Isınan sıvının ısısı, radyatör ve yine fan düzeneği yardımıyla azaltılmaktadır. Hava ile soğutma sistemine göre daha pahalı olmasına karşılık, sıvı ile soğutma sistemi daha etkilidir. Ayrıca daha az gürültülü çalışır. ’de sıvı ile soğutma sistemi uygulanmış bir bilgisayar kasası gösterilmiştir. 3.2.4.3. Isıl Borulu Soğutma Isıl borulu soğutma tekniğinde işlemcinin ısısı, soğutucu aracılığıyla içerisinde özel bir sıvı olan ısı borularına aktarılır. Bu özel sıvı, çok çabuk buharlaşabilen ve yoğunlaşabilen bir sıvıdır.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Sıvı ile Soğutma Sistemi",
        "Chunk_ID":3083
    },
    {
        "ID":98,
        "Soru":"İşletim sistemlerinde yazılım kaynaklı hataların giderilmesi sürecinde minimum donanım ihtiyacı ile yazılım uyumluluğu sorunlarının nedenleri ve çözüm yaklaşımları açısından analiz ediniz.",
        "İdeal Cevap (GT)":"Yazılım hatalarının tespiti ve düzeltilmesi sürecinde, minimum donanım ihtiyacı sorunu yazılımın çalışabilmesi için gerekli sistem kaynaklarının sağlanıp sağlanmadığının kontrol edilmesini gerektirirken, yazılım uyumluluk sorunu yazılımın işletim sistemi ile uygun olup olmadığının incelenmesini gerektirmektedir. Donanım ihtiyacı sorunu, gerekli seviyede donanım bulunmadığında yazılımların çalışmaması veya çalışma sırasında sorunlar meydana getirmesi nedeniyle, kaynakların yetersiz kaldığı durumlarda ortaya çıkan fiziksel bir kısıtlama olarak değerlendirilir. Buna karşılık uyumluluk sorunu, yazılımların belirli işletim sistemleri üzerinde çalışacak şekilde geliştirilmesinden kaynaklanan yapısal bir uyumsuzluk olarak tanımlanabilir. Çözüm yaklaşımları incelendiğinde, donanım sorunu için en az sistem kaynağının sağlanması yeterliyken, uyumluluk sorunu için \"Program uyumluluğu sorunu gidericisi\" çalıştırılması veya işletim sistemi sürümünün değiştirilmesi gibi işlemsel müdahaleler gerekmektedir. Her iki sorun türü de işletim sisteminin doğru çalışmasını etkileyerek, yazılımların yüklenmeden önce veya sorun anında bu teknik kriterlere göre değerlendirilmesi ihtiyacını doğurmaktadır.",
        "Bağlam (Context)":"5.21 İşletim Sistemleri ve Kurulum 173 5.7.1. Yazılım Hatasını Saptama ve Düzeltme İşletim sistemlerine yüklenen yazılımların neden olduğu sorunlar işletim sisteminin doğru çalışmasını etkileyebilir. Sorunların incelenip neden kaynaklandığının tespit edilmesi ve çözüm geliştirilmesi gerekmektedir. Yazılımlarda meydana gelebilecek sorunların muhtemel sebepleri ve yapılması gereken işlemler şunlardır: • Minimum Donanım İhtiyacı Sorunu: Bir yazılımın çalışabilmesi için gerekli olan donanım ihtiyacının giderilmesi gerekmektedir. Gerekli seviyede bulunmayan donanımla yazılımların çalışması mümkün olmayacak veya çalışma sırasında sorunlar meydana gelecektir. Bu sorunun yaşanmaması ve yazılımların yüklenmeden önce doğru bir şekilde çalışabilmesi için ihtiyaç duyduğu en az sistem kaynağının sağlanıp sağlanmadığı kontrol edilir. • Yazılım Uyumluluk Sorunu: Yazılımlar belirli işletim sistemleri üzerinde çalışacak şekilde geliştirilir. Bu nedenle yazılımın doğru bir şekilde çalışabilmesi için işletim sistemi ile uyumlu olması gerekir. “Program uyumluluğu sorunu gidericisi” çalıştırılarak yazılımların işletim sistemi ile uygun olup olmadığı kontrol edilir ve sorun giderilmeye çalışılır. Sorun devam ediyorsa yazılımın işletim sistemi ile uyumlu bir sürümü bulunarak yüklenir. Bilgisayara yüklü bir yazılımın işletim sistemi ile uygunluğunu kontrol ediniz. İşletim sistemi sürümünü değiştirerek yazılımın doğru bir şekilde çalışıp çalışmadığını kontrol ediniz.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Yazılım Hatalarının Tespiti ve Onarımı",
        "Chunk_ID":3410
    },
    {
        "ID":99,
        "Soru":"Örgü ve hücresel topolojilerin veri iletim yöntemleri ve güvenlik açısından avantajları ile dezavantajlarını analiz ederek karşılaştırınız.",
        "İdeal Cevap (GT)":"Örgü topolojisi fiziksel kablo bağlantıları üzerinden veri transferi gerçekleştirirken, hücresel topoloji veriyi elektromanyetik dalgalar hâlinde taşır. Örgü topolojisinde bağlantılardan birinin kopması durumunda verinin hedefe ulaşma avantajı bulunmasına rağmen, hücresel topolojide atmosfer ve uzay boşluğu dışında taşıyıcı ortam olmaması avantajı vardır. Örgü topolojisi kablo kirliliği yaratması ve omurgada yaşanacak bir kopmanın tüm sistemi etkilemesi gibi fiziksel dezavantajlara sahiptir. Buna karşın hücresel topolojide boşlukta dolaşan sinyal verisinin izlenip dinlenebilmesi nedeniyle veri güvenliği düşük seviyededir. Örgü topolojisi dar ortamlarda kurulmasının zor olması ve karışık bir bağlantı yapısına sahip olması nedeniyle dezavantaj oluştururken, hücresel topoloji kablosuz teknoloji sayesinde bölünmüş coğrafi alanlarda ve taşınabilir düğümler için elverişli yapıdadır.",
        "Bağlam (Context)":"Örgü Topolojisi (Mesh Topology) Örgü topolojisinde tüm cihazlar uçtan uca birbiriyle bağlıdır. Maliyet yönünden çok kullanışlı olmayan ve “point to point” (noktadan noktaya) olarak da adlandırılan sistem çok kablo kullanıldığı için tercih : Halka topolojisi : Yıldız topolojisi Dış Donanım Birimleri Ağ Temelleri 208 edilmez. ’de örgü topolojisine ait bağlantı diyagramı görülmektedir. → Avantajları • Bağlantılardan biri kopsa bile veri hedefine ulaşır. • Gönderilen veri en kısa sürede hedefine ulaşır. → Dezavantajları • Dar ortamlarda kurulması zordur. • Kablo kirliliği yaratır. • Karışık bir bağlantısı vardır. • Fazla kablo kullanıldığı için tercih edilmez. • Omurgada yaşanacak bir kopma tüm sistemi etkiler. 7.1.5.1.5. Hücresel Topoloji (Cellular Topology) ’de hücresel topolojiye ait bağlantı diyagramı görülmektedir. Hücresel topoloji, merkezinde bağımsız düğümler bulunan daire veya altıgen biçiminde topoloji yapısıdır. Kablosuz teknolojinin kullanımı ile önem kazanan bu topoloji, özellikle bölünmüş coğrafi alanlarda kullanılır. Veri elektromanyetik dalgalar hâlinde taşındığı için düğümler (kullanıcı) sabit veya taşınabilir olabilir. → Avantajı: Atmosfer ve uzay boşluğu dışında taşıyıcı ortamı yoktur. → Dezavantajı: Boşlukta dolaşan sinyal verisi izlenip dinlenebilir. Bu sebeple veri güvenliği düşük seviyededir. 7.1.5.2. Mantıksal Ağ Topolojileri Mantıksal topoloji fiziksel tasarımından bağımsız olarak ağdaki genel veri iletişimini gösterir.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"Örgü Topolojisi ve Özellikleri",
        "Chunk_ID":3513
    },
    {
        "ID":100,
        "Soru":"Kapalı ve açık kaynak işletim sistemlerinin bölgesel ayarlar konusunda sunduğu esnekliği ve bu ayarların uygulama programlarındaki veri türü görünümüne etkisini analiz ediniz.",
        "İdeal Cevap (GT)":"Kapalı ve açık kaynak işletim sistemlerinin tümünde cihaz konumlarının değişimi veya yaz saati uygulaması gibi nedenlerle bölge ve saat değişimlerine izin verilmektedir. Bölgesel ayarlar; kelime işlemci, hesap çizelgesi gibi uygulama programlarında tarih, saat ve para birimi gibi veri türlerinin görünümünü doğrudan etkilemektedir. Kapalı kaynak işletim sistemleri; çeşitli ülke dillerini, bu dilleri kullanan bölgelere ait para birimi, klavye düzeni ve biçimleri destekleyerek geniş bir uyumluluk sunmaktadır. Bu ayarların değiştirilebilmesi için sistem genelinde başlat menüsü ve ayarlar bağlantısı üzerinden erişilebilen yönetim adımları izlenmektedir. Sonuç olarak sistemler arası kaynak farkı gözetilmeksizin yapılan bu düzenlemeler, yazılımsal verilerin yerel standartlara uygun biçimlendirilmesini ve yorumlanmasını sağlamaktadır.",
        "Bağlam (Context)":"Çalışma alanı ekleyicisi özelliğini kullanarak iki adet masaüstü oluşturunuz. 5. Masaüstüne bir arka plan resmi atayınız ve iki farklı masaüstünde birer tane uygulamanın çalışmasını sağlayınız. 6.1.3. Saat, Dil ve Bölge Ayarları İşletim sistemi kurulum aşamasında saat, dil ve bölge ayarları belirlenir. Genellikle cihaz konumlarının değişimi, yaz saati uygulaması gibi nedenler sonucunda özellikle bölge ve saat değişimi gerçekleştirilmektedir. Kapalı veya açık kaynak işletim sistemlerinin tümünde bu değişimlere izin verilmektedir. 6.1.3.1. Kapalı Kaynak Sisteminde Saat, Dil ve Bölge Ayarları Bölgesel ayarlar; kelime işlemci, hesap çizelgesi gibi uygulama programlarında tarih, saat ve para birimi gibi veri türlerinin görünümünü etkiler. Kapalı kaynak işletim sistemi; çeşitli ülke dillerini, bu dilleri kullanan ülkeler veya bölgelere ait para birimi, tarih, saat, klavye düzeni gibi biçimleri destekler. Kapalı kaynak işletim sisteminde bölge ayarlarını değiştirmek için aşağıdaki uygulama adımlarını izleyiniz. Adım 1: “Başlat” düğmesi üzerinde farenin sağ tuşuna tıklayınız. Adım 2: Açılan menü penceresinde “Ayarlar” bağlantısına tıklayınız.",
        "Bloom Seviyesi":"Analyzing \/ Evaluating",
        "Konu":"İşletim Sistemi Masaüstü ve Ayarlar",
        "Chunk_ID":3461
    }
]